RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/psram_uhs_reg.h
/**
  ******************************************************************************
  * @file    psram_uhs_reg.h
  * @version V1.0
  * @date    2021-07-13
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __PSRAM_UHS_REG_H__
#define __PSRAM_UHS_REG_H__

#include "bl808.h"

/* 0x0 : UHS_basic */
#define PSRAM_UHS_UHS_BASIC_OFFSET      (0x0)
#define PSRAM_UHS_REG_INIT_EN           PSRAM_UHS_REG_INIT_EN
#define PSRAM_UHS_REG_INIT_EN_POS       (0U)
#define PSRAM_UHS_REG_INIT_EN_LEN       (1U)
#define PSRAM_UHS_REG_INIT_EN_MSK       (((1U << PSRAM_UHS_REG_INIT_EN_LEN) - 1) << PSRAM_UHS_REG_INIT_EN_POS)
#define PSRAM_UHS_REG_INIT_EN_UMSK      (~(((1U << PSRAM_UHS_REG_INIT_EN_LEN) - 1) << PSRAM_UHS_REG_INIT_EN_POS))
#define PSRAM_UHS_REG_AF_EN             PSRAM_UHS_REG_AF_EN
#define PSRAM_UHS_REG_AF_EN_POS         (1U)
#define PSRAM_UHS_REG_AF_EN_LEN         (1U)
#define PSRAM_UHS_REG_AF_EN_MSK         (((1U << PSRAM_UHS_REG_AF_EN_LEN) - 1) << PSRAM_UHS_REG_AF_EN_POS)
#define PSRAM_UHS_REG_AF_EN_UMSK        (~(((1U << PSRAM_UHS_REG_AF_EN_LEN) - 1) << PSRAM_UHS_REG_AF_EN_POS))
#define PSRAM_UHS_REG_CONFIG_REQ        PSRAM_UHS_REG_CONFIG_REQ
#define PSRAM_UHS_REG_CONFIG_REQ_POS    (2U)
#define PSRAM_UHS_REG_CONFIG_REQ_LEN    (1U)
#define PSRAM_UHS_REG_CONFIG_REQ_MSK    (((1U << PSRAM_UHS_REG_CONFIG_REQ_LEN) - 1) << PSRAM_UHS_REG_CONFIG_REQ_POS)
#define PSRAM_UHS_REG_CONFIG_REQ_UMSK   (~(((1U << PSRAM_UHS_REG_CONFIG_REQ_LEN) - 1) << PSRAM_UHS_REG_CONFIG_REQ_POS))
#define PSRAM_UHS_REG_CONFIG_GNT        PSRAM_UHS_REG_CONFIG_GNT
#define PSRAM_UHS_REG_CONFIG_GNT_POS    (3U)
#define PSRAM_UHS_REG_CONFIG_GNT_LEN    (1U)
#define PSRAM_UHS_REG_CONFIG_GNT_MSK    (((1U << PSRAM_UHS_REG_CONFIG_GNT_LEN) - 1) << PSRAM_UHS_REG_CONFIG_GNT_POS)
#define PSRAM_UHS_REG_CONFIG_GNT_UMSK   (~(((1U << PSRAM_UHS_REG_CONFIG_GNT_LEN) - 1) << PSRAM_UHS_REG_CONFIG_GNT_POS))
#define PSRAM_UHS_REG_MODE_REG          PSRAM_UHS_REG_MODE_REG
#define PSRAM_UHS_REG_MODE_REG_POS      (8U)
#define PSRAM_UHS_REG_MODE_REG_LEN      (8U)
#define PSRAM_UHS_REG_MODE_REG_MSK      (((1U << PSRAM_UHS_REG_MODE_REG_LEN) - 1) << PSRAM_UHS_REG_MODE_REG_POS)
#define PSRAM_UHS_REG_MODE_REG_UMSK     (~(((1U << PSRAM_UHS_REG_MODE_REG_LEN) - 1) << PSRAM_UHS_REG_MODE_REG_POS))
#define PSRAM_UHS_REG_ADDRMB_MSK        PSRAM_UHS_REG_ADDRMB_MSK
#define PSRAM_UHS_REG_ADDRMB_MSK_POS    (16U)
#define PSRAM_UHS_REG_ADDRMB_MSK_LEN    (8U)
#define PSRAM_UHS_REG_ADDRMB_MSK_MSK    (((1U << PSRAM_UHS_REG_ADDRMB_MSK_LEN) - 1) << PSRAM_UHS_REG_ADDRMB_MSK_POS)
#define PSRAM_UHS_REG_ADDRMB_MSK_UMSK   (~(((1U << PSRAM_UHS_REG_ADDRMB_MSK_LEN) - 1) << PSRAM_UHS_REG_ADDRMB_MSK_POS))
#define PSRAM_UHS_REG_LINEAR_BND_B      PSRAM_UHS_REG_LINEAR_BND_B
#define PSRAM_UHS_REG_LINEAR_BND_B_POS  (28U)
#define PSRAM_UHS_REG_LINEAR_BND_B_LEN  (4U)
#define PSRAM_UHS_REG_LINEAR_BND_B_MSK  (((1U << PSRAM_UHS_REG_LINEAR_BND_B_LEN) - 1) << PSRAM_UHS_REG_LINEAR_BND_B_POS)
#define PSRAM_UHS_REG_LINEAR_BND_B_UMSK (~(((1U << PSRAM_UHS_REG_LINEAR_BND_B_LEN) - 1) << PSRAM_UHS_REG_LINEAR_BND_B_POS))

/* 0x4 : UHS_cmd */
#define PSRAM_UHS_UHS_CMD_OFFSET       (0x4)
#define PSRAM_UHS_REG_GLBR_PULSE       PSRAM_UHS_REG_GLBR_PULSE
#define PSRAM_UHS_REG_GLBR_PULSE_POS   (0U)
#define PSRAM_UHS_REG_GLBR_PULSE_LEN   (1U)
#define PSRAM_UHS_REG_GLBR_PULSE_MSK   (((1U << PSRAM_UHS_REG_GLBR_PULSE_LEN) - 1) << PSRAM_UHS_REG_GLBR_PULSE_POS)
#define PSRAM_UHS_REG_GLBR_PULSE_UMSK  (~(((1U << PSRAM_UHS_REG_GLBR_PULSE_LEN) - 1) << PSRAM_UHS_REG_GLBR_PULSE_POS))
#define PSRAM_UHS_REG_SRFI_PULSE       PSRAM_UHS_REG_SRFI_PULSE
#define PSRAM_UHS_REG_SRFI_PULSE_POS   (1U)
#define PSRAM_UHS_REG_SRFI_PULSE_LEN   (1U)
#define PSRAM_UHS_REG_SRFI_PULSE_MSK   (((1U << PSRAM_UHS_REG_SRFI_PULSE_LEN) - 1) << PSRAM_UHS_REG_SRFI_PULSE_POS)
#define PSRAM_UHS_REG_SRFI_PULSE_UMSK  (~(((1U << PSRAM_UHS_REG_SRFI_PULSE_LEN) - 1) << PSRAM_UHS_REG_SRFI_PULSE_POS))
#define PSRAM_UHS_REG_SRFO_PULSE       PSRAM_UHS_REG_SRFO_PULSE
#define PSRAM_UHS_REG_SRFO_PULSE_POS   (2U)
#define PSRAM_UHS_REG_SRFO_PULSE_LEN   (1U)
#define PSRAM_UHS_REG_SRFO_PULSE_MSK   (((1U << PSRAM_UHS_REG_SRFO_PULSE_LEN) - 1) << PSRAM_UHS_REG_SRFO_PULSE_POS)
#define PSRAM_UHS_REG_SRFO_PULSE_UMSK  (~(((1U << PSRAM_UHS_REG_SRFO_PULSE_LEN) - 1) << PSRAM_UHS_REG_SRFO_PULSE_POS))
#define PSRAM_UHS_REG_REGW_PULSE       PSRAM_UHS_REG_REGW_PULSE
#define PSRAM_UHS_REG_REGW_PULSE_POS   (3U)
#define PSRAM_UHS_REG_REGW_PULSE_LEN   (1U)
#define PSRAM_UHS_REG_REGW_PULSE_MSK   (((1U << PSRAM_UHS_REG_REGW_PULSE_LEN) - 1) << PSRAM_UHS_REG_REGW_PULSE_POS)
#define PSRAM_UHS_REG_REGW_PULSE_UMSK  (~(((1U << PSRAM_UHS_REG_REGW_PULSE_LEN) - 1) << PSRAM_UHS_REG_REGW_PULSE_POS))
#define PSRAM_UHS_REG_REGR_PULSE       PSRAM_UHS_REG_REGR_PULSE
#define PSRAM_UHS_REG_REGR_PULSE_POS   (4U)
#define PSRAM_UHS_REG_REGR_PULSE_LEN   (1U)
#define PSRAM_UHS_REG_REGR_PULSE_MSK   (((1U << PSRAM_UHS_REG_REGR_PULSE_LEN) - 1) << PSRAM_UHS_REG_REGR_PULSE_POS)
#define PSRAM_UHS_REG_REGR_PULSE_UMSK  (~(((1U << PSRAM_UHS_REG_REGR_PULSE_LEN) - 1) << PSRAM_UHS_REG_REGR_PULSE_POS))
#define PSRAM_UHS_STS_GLBR_DONE        PSRAM_UHS_STS_GLBR_DONE
#define PSRAM_UHS_STS_GLBR_DONE_POS    (8U)
#define PSRAM_UHS_STS_GLBR_DONE_LEN    (1U)
#define PSRAM_UHS_STS_GLBR_DONE_MSK    (((1U << PSRAM_UHS_STS_GLBR_DONE_LEN) - 1) << PSRAM_UHS_STS_GLBR_DONE_POS)
#define PSRAM_UHS_STS_GLBR_DONE_UMSK   (~(((1U << PSRAM_UHS_STS_GLBR_DONE_LEN) - 1) << PSRAM_UHS_STS_GLBR_DONE_POS))
#define PSRAM_UHS_STS_SRFI_DONE        PSRAM_UHS_STS_SRFI_DONE
#define PSRAM_UHS_STS_SRFI_DONE_POS    (9U)
#define PSRAM_UHS_STS_SRFI_DONE_LEN    (1U)
#define PSRAM_UHS_STS_SRFI_DONE_MSK    (((1U << PSRAM_UHS_STS_SRFI_DONE_LEN) - 1) << PSRAM_UHS_STS_SRFI_DONE_POS)
#define PSRAM_UHS_STS_SRFI_DONE_UMSK   (~(((1U << PSRAM_UHS_STS_SRFI_DONE_LEN) - 1) << PSRAM_UHS_STS_SRFI_DONE_POS))
#define PSRAM_UHS_STS_SRFO_DONE        PSRAM_UHS_STS_SRFO_DONE
#define PSRAM_UHS_STS_SRFO_DONE_POS    (10U)
#define PSRAM_UHS_STS_SRFO_DONE_LEN    (1U)
#define PSRAM_UHS_STS_SRFO_DONE_MSK    (((1U << PSRAM_UHS_STS_SRFO_DONE_LEN) - 1) << PSRAM_UHS_STS_SRFO_DONE_POS)
#define PSRAM_UHS_STS_SRFO_DONE_UMSK   (~(((1U << PSRAM_UHS_STS_SRFO_DONE_LEN) - 1) << PSRAM_UHS_STS_SRFO_DONE_POS))
#define PSRAM_UHS_STS_REGW_DONE        PSRAM_UHS_STS_REGW_DONE
#define PSRAM_UHS_STS_REGW_DONE_POS    (11U)
#define PSRAM_UHS_STS_REGW_DONE_LEN    (1U)
#define PSRAM_UHS_STS_REGW_DONE_MSK    (((1U << PSRAM_UHS_STS_REGW_DONE_LEN) - 1) << PSRAM_UHS_STS_REGW_DONE_POS)
#define PSRAM_UHS_STS_REGW_DONE_UMSK   (~(((1U << PSRAM_UHS_STS_REGW_DONE_LEN) - 1) << PSRAM_UHS_STS_REGW_DONE_POS))
#define PSRAM_UHS_STS_REGR_DONE        PSRAM_UHS_STS_REGR_DONE
#define PSRAM_UHS_STS_REGR_DONE_POS    (12U)
#define PSRAM_UHS_STS_REGR_DONE_LEN    (1U)
#define PSRAM_UHS_STS_REGR_DONE_MSK    (((1U << PSRAM_UHS_STS_REGR_DONE_LEN) - 1) << PSRAM_UHS_STS_REGR_DONE_POS)
#define PSRAM_UHS_STS_REGR_DONE_UMSK   (~(((1U << PSRAM_UHS_STS_REGR_DONE_LEN) - 1) << PSRAM_UHS_STS_REGR_DONE_POS))
#define PSRAM_UHS_STS_INIT_DONE        PSRAM_UHS_STS_INIT_DONE
#define PSRAM_UHS_STS_INIT_DONE_POS    (13U)
#define PSRAM_UHS_STS_INIT_DONE_LEN    (1U)
#define PSRAM_UHS_STS_INIT_DONE_MSK    (((1U << PSRAM_UHS_STS_INIT_DONE_LEN) - 1) << PSRAM_UHS_STS_INIT_DONE_POS)
#define PSRAM_UHS_STS_INIT_DONE_UMSK   (~(((1U << PSRAM_UHS_STS_INIT_DONE_LEN) - 1) << PSRAM_UHS_STS_INIT_DONE_POS))
#define PSRAM_UHS_STS_CONFIG_READ      PSRAM_UHS_STS_CONFIG_READ
#define PSRAM_UHS_STS_CONFIG_READ_POS  (24U)
#define PSRAM_UHS_STS_CONFIG_READ_LEN  (8U)
#define PSRAM_UHS_STS_CONFIG_READ_MSK  (((1U << PSRAM_UHS_STS_CONFIG_READ_LEN) - 1) << PSRAM_UHS_STS_CONFIG_READ_POS)
#define PSRAM_UHS_STS_CONFIG_READ_UMSK (~(((1U << PSRAM_UHS_STS_CONFIG_READ_LEN) - 1) << PSRAM_UHS_STS_CONFIG_READ_POS))

