RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/psram_uhs_reg.h
/* 0x8 : UHS_fifo_thre */
#define PSRAM_UHS_UHS_FIFO_THRE_OFFSET     (0x8)
#define PSRAM_UHS_REG_MASK_W_FIFO_CNT      PSRAM_UHS_REG_MASK_W_FIFO_CNT
#define PSRAM_UHS_REG_MASK_W_FIFO_CNT_POS  (0U)
#define PSRAM_UHS_REG_MASK_W_FIFO_CNT_LEN  (16U)
#define PSRAM_UHS_REG_MASK_W_FIFO_CNT_MSK  (((1U << PSRAM_UHS_REG_MASK_W_FIFO_CNT_LEN) - 1) << PSRAM_UHS_REG_MASK_W_FIFO_CNT_POS)
#define PSRAM_UHS_REG_MASK_W_FIFO_CNT_UMSK (~(((1U << PSRAM_UHS_REG_MASK_W_FIFO_CNT_LEN) - 1) << PSRAM_UHS_REG_MASK_W_FIFO_CNT_POS))
#define PSRAM_UHS_REG_MASK_R_FIFO_REM      PSRAM_UHS_REG_MASK_R_FIFO_REM
#define PSRAM_UHS_REG_MASK_R_FIFO_REM_POS  (16U)
#define PSRAM_UHS_REG_MASK_R_FIFO_REM_LEN  (16U)
#define PSRAM_UHS_REG_MASK_R_FIFO_REM_MSK  (((1U << PSRAM_UHS_REG_MASK_R_FIFO_REM_LEN) - 1) << PSRAM_UHS_REG_MASK_R_FIFO_REM_POS)
#define PSRAM_UHS_REG_MASK_R_FIFO_REM_UMSK (~(((1U << PSRAM_UHS_REG_MASK_R_FIFO_REM_LEN) - 1) << PSRAM_UHS_REG_MASK_R_FIFO_REM_POS))

/* 0xC : UHS_manual */
#define PSRAM_UHS_UHS_MANUAL_OFFSET       (0xC)
#define PSRAM_UHS_REG_FORCE_CEB_LOW       PSRAM_UHS_REG_FORCE_CEB_LOW
#define PSRAM_UHS_REG_FORCE_CEB_LOW_POS   (0U)
#define PSRAM_UHS_REG_FORCE_CEB_LOW_LEN   (1U)
#define PSRAM_UHS_REG_FORCE_CEB_LOW_MSK   (((1U << PSRAM_UHS_REG_FORCE_CEB_LOW_LEN) - 1) << PSRAM_UHS_REG_FORCE_CEB_LOW_POS)
#define PSRAM_UHS_REG_FORCE_CEB_LOW_UMSK  (~(((1U << PSRAM_UHS_REG_FORCE_CEB_LOW_LEN) - 1) << PSRAM_UHS_REG_FORCE_CEB_LOW_POS))
#define PSRAM_UHS_REG_FORCE_CEB_HIGH      PSRAM_UHS_REG_FORCE_CEB_HIGH
#define PSRAM_UHS_REG_FORCE_CEB_HIGH_POS  (1U)
#define PSRAM_UHS_REG_FORCE_CEB_HIGH_LEN  (1U)
#define PSRAM_UHS_REG_FORCE_CEB_HIGH_MSK  (((1U << PSRAM_UHS_REG_FORCE_CEB_HIGH_LEN) - 1) << PSRAM_UHS_REG_FORCE_CEB_HIGH_POS)
#define PSRAM_UHS_REG_FORCE_CEB_HIGH_UMSK (~(((1U << PSRAM_UHS_REG_FORCE_CEB_HIGH_LEN) - 1) << PSRAM_UHS_REG_FORCE_CEB_HIGH_POS))
#define PSRAM_UHS_REG_PSRAM_RESETB        PSRAM_UHS_REG_PSRAM_RESETB
#define PSRAM_UHS_REG_PSRAM_RESETB_POS    (2U)
#define PSRAM_UHS_REG_PSRAM_RESETB_LEN    (1U)
#define PSRAM_UHS_REG_PSRAM_RESETB_MSK    (((1U << PSRAM_UHS_REG_PSRAM_RESETB_LEN) - 1) << PSRAM_UHS_REG_PSRAM_RESETB_POS)
#define PSRAM_UHS_REG_PSRAM_RESETB_UMSK   (~(((1U << PSRAM_UHS_REG_PSRAM_RESETB_LEN) - 1) << PSRAM_UHS_REG_PSRAM_RESETB_POS))
#define PSRAM_UHS_REG_X16_MODE            PSRAM_UHS_REG_X16_MODE
#define PSRAM_UHS_REG_X16_MODE_POS        (3U)
#define PSRAM_UHS_REG_X16_MODE_LEN        (1U)
#define PSRAM_UHS_REG_X16_MODE_MSK        (((1U << PSRAM_UHS_REG_X16_MODE_LEN) - 1) << PSRAM_UHS_REG_X16_MODE_POS)
#define PSRAM_UHS_REG_X16_MODE_UMSK       (~(((1U << PSRAM_UHS_REG_X16_MODE_LEN) - 1) << PSRAM_UHS_REG_X16_MODE_POS))
#define PSRAM_UHS_REG_WRAP2INCR_EN        PSRAM_UHS_REG_WRAP2INCR_EN
#define PSRAM_UHS_REG_WRAP2INCR_EN_POS    (4U)
#define PSRAM_UHS_REG_WRAP2INCR_EN_LEN    (1U)
#define PSRAM_UHS_REG_WRAP2INCR_EN_MSK    (((1U << PSRAM_UHS_REG_WRAP2INCR_EN_LEN) - 1) << PSRAM_UHS_REG_WRAP2INCR_EN_POS)
#define PSRAM_UHS_REG_WRAP2INCR_EN_UMSK   (~(((1U << PSRAM_UHS_REG_WRAP2INCR_EN_LEN) - 1) << PSRAM_UHS_REG_WRAP2INCR_EN_POS))
#define PSRAM_UHS_REG_PCK_S_DIV           PSRAM_UHS_REG_PCK_S_DIV
#define PSRAM_UHS_REG_PCK_S_DIV_POS       (16U)
#define PSRAM_UHS_REG_PCK_S_DIV_LEN       (3U)
#define PSRAM_UHS_REG_PCK_S_DIV_MSK       (((1U << PSRAM_UHS_REG_PCK_S_DIV_LEN) - 1) << PSRAM_UHS_REG_PCK_S_DIV_POS)
#define PSRAM_UHS_REG_PCK_S_DIV_UMSK      (~(((1U << PSRAM_UHS_REG_PCK_S_DIV_LEN) - 1) << PSRAM_UHS_REG_PCK_S_DIV_POS))
#define PSRAM_UHS_REG_PCK_T_DIV           PSRAM_UHS_REG_PCK_T_DIV
#define PSRAM_UHS_REG_PCK_T_DIV_POS       (24U)
#define PSRAM_UHS_REG_PCK_T_DIV_LEN       (8U)
#define PSRAM_UHS_REG_PCK_T_DIV_MSK       (((1U << PSRAM_UHS_REG_PCK_T_DIV_LEN) - 1) << PSRAM_UHS_REG_PCK_T_DIV_POS)
#define PSRAM_UHS_REG_PCK_T_DIV_UMSK      (~(((1U << PSRAM_UHS_REG_PCK_T_DIV_LEN) - 1) << PSRAM_UHS_REG_PCK_T_DIV_POS))

/* 0x10 : UHS_auto_fresh_1 */
#define PSRAM_UHS_UHS_AUTO_FRESH_1_OFFSET (0x10)
#define PSRAM_UHS_REG_WIN_CYCLE           PSRAM_UHS_REG_WIN_CYCLE
#define PSRAM_UHS_REG_WIN_CYCLE_POS       (0U)
#define PSRAM_UHS_REG_WIN_CYCLE_LEN       (28U)
#define PSRAM_UHS_REG_WIN_CYCLE_MSK       (((1U << PSRAM_UHS_REG_WIN_CYCLE_LEN) - 1) << PSRAM_UHS_REG_WIN_CYCLE_POS)
#define PSRAM_UHS_REG_WIN_CYCLE_UMSK      (~(((1U << PSRAM_UHS_REG_WIN_CYCLE_LEN) - 1) << PSRAM_UHS_REG_WIN_CYCLE_POS))

/* 0x14 : UHS_auto_fresh_2 */
#define PSRAM_UHS_UHS_AUTO_FRESH_2_OFFSET (0x14)
#define PSRAM_UHS_REG_REFI_CYCLE          PSRAM_UHS_REG_REFI_CYCLE
#define PSRAM_UHS_REG_REFI_CYCLE_POS      (0U)
#define PSRAM_UHS_REG_REFI_CYCLE_LEN      (16U)
#define PSRAM_UHS_REG_REFI_CYCLE_MSK      (((1U << PSRAM_UHS_REG_REFI_CYCLE_LEN) - 1) << PSRAM_UHS_REG_REFI_CYCLE_POS)
#define PSRAM_UHS_REG_REFI_CYCLE_UMSK     (~(((1U << PSRAM_UHS_REG_REFI_CYCLE_LEN) - 1) << PSRAM_UHS_REG_REFI_CYCLE_POS))
#define PSRAM_UHS_REG_WIN_REF_CNT         PSRAM_UHS_REG_WIN_REF_CNT
#define PSRAM_UHS_REG_WIN_REF_CNT_POS     (16U)
#define PSRAM_UHS_REG_WIN_REF_CNT_LEN     (13U)
#define PSRAM_UHS_REG_WIN_REF_CNT_MSK     (((1U << PSRAM_UHS_REG_WIN_REF_CNT_LEN) - 1) << PSRAM_UHS_REG_WIN_REF_CNT_POS)
#define PSRAM_UHS_REG_WIN_REF_CNT_UMSK    (~(((1U << PSRAM_UHS_REG_WIN_REF_CNT_LEN) - 1) << PSRAM_UHS_REG_WIN_REF_CNT_POS))

/* 0x18 : UHS_auto_fresh_3 */
#define PSRAM_UHS_UHS_AUTO_FRESH_3_OFFSET (0x18)
#define PSRAM_UHS_REG_AUTO_REF_THRE       PSRAM_UHS_REG_AUTO_REF_THRE
#define PSRAM_UHS_REG_AUTO_REF_THRE_POS   (0U)
#define PSRAM_UHS_REG_AUTO_REF_THRE_LEN   (12U)
#define PSRAM_UHS_REG_AUTO_REF_THRE_MSK   (((1U << PSRAM_UHS_REG_AUTO_REF_THRE_LEN) - 1) << PSRAM_UHS_REG_AUTO_REF_THRE_POS)
#define PSRAM_UHS_REG_AUTO_REF_THRE_UMSK  (~(((1U << PSRAM_UHS_REG_AUTO_REF_THRE_LEN) - 1) << PSRAM_UHS_REG_AUTO_REF_THRE_POS))
#define PSRAM_UHS_AUTO_REFRESH_LEVEL      PSRAM_UHS_AUTO_REFRESH_LEVEL
#define PSRAM_UHS_AUTO_REFRESH_LEVEL_POS  (16U)
#define PSRAM_UHS_AUTO_REFRESH_LEVEL_LEN  (12U)
#define PSRAM_UHS_AUTO_REFRESH_LEVEL_MSK  (((1U << PSRAM_UHS_AUTO_REFRESH_LEVEL_LEN) - 1) << PSRAM_UHS_AUTO_REFRESH_LEVEL_POS)
#define PSRAM_UHS_AUTO_REFRESH_LEVEL_UMSK (~(((1U << PSRAM_UHS_AUTO_REFRESH_LEVEL_LEN) - 1) << PSRAM_UHS_AUTO_REFRESH_LEVEL_POS))

/* 0x1C : UHS_auto_fresh_4 */
#define PSRAM_UHS_UHS_AUTO_FRESH_4_OFFSET (0x1C)
#define PSRAM_UHS_REG_BUST_CYCLE          PSRAM_UHS_REG_BUST_CYCLE
#define PSRAM_UHS_REG_BUST_CYCLE_POS      (0U)
#define PSRAM_UHS_REG_BUST_CYCLE_LEN      (7U)
#define PSRAM_UHS_REG_BUST_CYCLE_MSK      (((1U << PSRAM_UHS_REG_BUST_CYCLE_LEN) - 1) << PSRAM_UHS_REG_BUST_CYCLE_POS)
#define PSRAM_UHS_REG_BUST_CYCLE_UMSK     (~(((1U << PSRAM_UHS_REG_BUST_CYCLE_LEN) - 1) << PSRAM_UHS_REG_BUST_CYCLE_POS))

