RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/psram_uhs_reg.h
/* 0x20 : UHS_psram_configure */
#define PSRAM_UHS_UHS_PSRAM_CONFIGURE_OFFSET (0x20)
#define PSRAM_UHS_REG_UHS_LATENCY            PSRAM_UHS_REG_UHS_LATENCY
#define PSRAM_UHS_REG_UHS_LATENCY_POS        (0U)
#define PSRAM_UHS_REG_UHS_LATENCY_LEN        (3U)
#define PSRAM_UHS_REG_UHS_LATENCY_MSK        (((1U << PSRAM_UHS_REG_UHS_LATENCY_LEN) - 1) << PSRAM_UHS_REG_UHS_LATENCY_POS)
#define PSRAM_UHS_REG_UHS_LATENCY_UMSK       (~(((1U << PSRAM_UHS_REG_UHS_LATENCY_LEN) - 1) << PSRAM_UHS_REG_UHS_LATENCY_POS))
#define PSRAM_UHS_REG_UHS_DRIVE_ST           PSRAM_UHS_REG_UHS_DRIVE_ST
#define PSRAM_UHS_REG_UHS_DRIVE_ST_POS       (4U)
#define PSRAM_UHS_REG_UHS_DRIVE_ST_LEN       (4U)
#define PSRAM_UHS_REG_UHS_DRIVE_ST_MSK       (((1U << PSRAM_UHS_REG_UHS_DRIVE_ST_LEN) - 1) << PSRAM_UHS_REG_UHS_DRIVE_ST_POS)
#define PSRAM_UHS_REG_UHS_DRIVE_ST_UMSK      (~(((1U << PSRAM_UHS_REG_UHS_DRIVE_ST_LEN) - 1) << PSRAM_UHS_REG_UHS_DRIVE_ST_POS))
#define PSRAM_UHS_REG_UHS_BL_16              PSRAM_UHS_REG_UHS_BL_16
#define PSRAM_UHS_REG_UHS_BL_16_POS          (8U)
#define PSRAM_UHS_REG_UHS_BL_16_LEN          (1U)
#define PSRAM_UHS_REG_UHS_BL_16_MSK          (((1U << PSRAM_UHS_REG_UHS_BL_16_LEN) - 1) << PSRAM_UHS_REG_UHS_BL_16_POS)
#define PSRAM_UHS_REG_UHS_BL_16_UMSK         (~(((1U << PSRAM_UHS_REG_UHS_BL_16_LEN) - 1) << PSRAM_UHS_REG_UHS_BL_16_POS))
#define PSRAM_UHS_REG_UHS_BL_32              PSRAM_UHS_REG_UHS_BL_32
#define PSRAM_UHS_REG_UHS_BL_32_POS          (9U)
#define PSRAM_UHS_REG_UHS_BL_32_LEN          (1U)
#define PSRAM_UHS_REG_UHS_BL_32_MSK          (((1U << PSRAM_UHS_REG_UHS_BL_32_LEN) - 1) << PSRAM_UHS_REG_UHS_BL_32_POS)
#define PSRAM_UHS_REG_UHS_BL_32_UMSK         (~(((1U << PSRAM_UHS_REG_UHS_BL_32_LEN) - 1) << PSRAM_UHS_REG_UHS_BL_32_POS))
#define PSRAM_UHS_REG_UHS_BL_64              PSRAM_UHS_REG_UHS_BL_64
#define PSRAM_UHS_REG_UHS_BL_64_POS          (10U)
#define PSRAM_UHS_REG_UHS_BL_64_LEN          (1U)
#define PSRAM_UHS_REG_UHS_BL_64_MSK          (((1U << PSRAM_UHS_REG_UHS_BL_64_LEN) - 1) << PSRAM_UHS_REG_UHS_BL_64_POS)
#define PSRAM_UHS_REG_UHS_BL_64_UMSK         (~(((1U << PSRAM_UHS_REG_UHS_BL_64_LEN) - 1) << PSRAM_UHS_REG_UHS_BL_64_POS))

/* 0x24 : UHS_psram_status */
#define PSRAM_UHS_UHS_PSRAM_STATUS_OFFSET (0x24)
#define PSRAM_UHS_STS_UHS_LATENCY         PSRAM_UHS_STS_UHS_LATENCY
#define PSRAM_UHS_STS_UHS_LATENCY_POS     (0U)
#define PSRAM_UHS_STS_UHS_LATENCY_LEN     (3U)
#define PSRAM_UHS_STS_UHS_LATENCY_MSK     (((1U << PSRAM_UHS_STS_UHS_LATENCY_LEN) - 1) << PSRAM_UHS_STS_UHS_LATENCY_POS)
#define PSRAM_UHS_STS_UHS_LATENCY_UMSK    (~(((1U << PSRAM_UHS_STS_UHS_LATENCY_LEN) - 1) << PSRAM_UHS_STS_UHS_LATENCY_POS))
#define PSRAM_UHS_STS_UHS_DRIVE_ST        PSRAM_UHS_STS_UHS_DRIVE_ST
#define PSRAM_UHS_STS_UHS_DRIVE_ST_POS    (4U)
#define PSRAM_UHS_STS_UHS_DRIVE_ST_LEN    (4U)
#define PSRAM_UHS_STS_UHS_DRIVE_ST_MSK    (((1U << PSRAM_UHS_STS_UHS_DRIVE_ST_LEN) - 1) << PSRAM_UHS_STS_UHS_DRIVE_ST_POS)
#define PSRAM_UHS_STS_UHS_DRIVE_ST_UMSK   (~(((1U << PSRAM_UHS_STS_UHS_DRIVE_ST_LEN) - 1) << PSRAM_UHS_STS_UHS_DRIVE_ST_POS))
#define PSRAM_UHS_STS_UHS_BL_16           PSRAM_UHS_STS_UHS_BL_16
#define PSRAM_UHS_STS_UHS_BL_16_POS       (8U)
#define PSRAM_UHS_STS_UHS_BL_16_LEN       (1U)
#define PSRAM_UHS_STS_UHS_BL_16_MSK       (((1U << PSRAM_UHS_STS_UHS_BL_16_LEN) - 1) << PSRAM_UHS_STS_UHS_BL_16_POS)
#define PSRAM_UHS_STS_UHS_BL_16_UMSK      (~(((1U << PSRAM_UHS_STS_UHS_BL_16_LEN) - 1) << PSRAM_UHS_STS_UHS_BL_16_POS))
#define PSRAM_UHS_STS_UHS_BL_32           PSRAM_UHS_STS_UHS_BL_32
#define PSRAM_UHS_STS_UHS_BL_32_POS       (9U)
#define PSRAM_UHS_STS_UHS_BL_32_LEN       (1U)
#define PSRAM_UHS_STS_UHS_BL_32_MSK       (((1U << PSRAM_UHS_STS_UHS_BL_32_LEN) - 1) << PSRAM_UHS_STS_UHS_BL_32_POS)
#define PSRAM_UHS_STS_UHS_BL_32_UMSK      (~(((1U << PSRAM_UHS_STS_UHS_BL_32_LEN) - 1) << PSRAM_UHS_STS_UHS_BL_32_POS))
#define PSRAM_UHS_STS_UHS_BL_64           PSRAM_UHS_STS_UHS_BL_64
#define PSRAM_UHS_STS_UHS_BL_64_POS       (10U)
#define PSRAM_UHS_STS_UHS_BL_64_LEN       (1U)
#define PSRAM_UHS_STS_UHS_BL_64_MSK       (((1U << PSRAM_UHS_STS_UHS_BL_64_LEN) - 1) << PSRAM_UHS_STS_UHS_BL_64_POS)
#define PSRAM_UHS_STS_UHS_BL_64_UMSK      (~(((1U << PSRAM_UHS_STS_UHS_BL_64_LEN) - 1) << PSRAM_UHS_STS_UHS_BL_64_POS))

/* 0x30 : UHS_timing_ctrl */
#define PSRAM_UHS_UHS_TIMING_CTRL_OFFSET (0x30)
#define PSRAM_UHS_REG_TRC_CYCLE          PSRAM_UHS_REG_TRC_CYCLE
#define PSRAM_UHS_REG_TRC_CYCLE_POS      (0U)
#define PSRAM_UHS_REG_TRC_CYCLE_LEN      (8U)
#define PSRAM_UHS_REG_TRC_CYCLE_MSK      (((1U << PSRAM_UHS_REG_TRC_CYCLE_LEN) - 1) << PSRAM_UHS_REG_TRC_CYCLE_POS)
#define PSRAM_UHS_REG_TRC_CYCLE_UMSK     (~(((1U << PSRAM_UHS_REG_TRC_CYCLE_LEN) - 1) << PSRAM_UHS_REG_TRC_CYCLE_POS))
#define PSRAM_UHS_REG_TCPHR_CYCLE        PSRAM_UHS_REG_TCPHR_CYCLE
#define PSRAM_UHS_REG_TCPHR_CYCLE_POS    (8U)
#define PSRAM_UHS_REG_TCPHR_CYCLE_LEN    (8U)
#define PSRAM_UHS_REG_TCPHR_CYCLE_MSK    (((1U << PSRAM_UHS_REG_TCPHR_CYCLE_LEN) - 1) << PSRAM_UHS_REG_TCPHR_CYCLE_POS)
#define PSRAM_UHS_REG_TCPHR_CYCLE_UMSK   (~(((1U << PSRAM_UHS_REG_TCPHR_CYCLE_LEN) - 1) << PSRAM_UHS_REG_TCPHR_CYCLE_POS))
#define PSRAM_UHS_REG_TCPHW_CYCLE        PSRAM_UHS_REG_TCPHW_CYCLE
#define PSRAM_UHS_REG_TCPHW_CYCLE_POS    (16U)
#define PSRAM_UHS_REG_TCPHW_CYCLE_LEN    (8U)
#define PSRAM_UHS_REG_TCPHW_CYCLE_MSK    (((1U << PSRAM_UHS_REG_TCPHW_CYCLE_LEN) - 1) << PSRAM_UHS_REG_TCPHW_CYCLE_POS)
#define PSRAM_UHS_REG_TCPHW_CYCLE_UMSK   (~(((1U << PSRAM_UHS_REG_TCPHW_CYCLE_LEN) - 1) << PSRAM_UHS_REG_TCPHW_CYCLE_POS))
#define PSRAM_UHS_REG_TRFC_CYCLE         PSRAM_UHS_REG_TRFC_CYCLE
#define PSRAM_UHS_REG_TRFC_CYCLE_POS     (24U)
#define PSRAM_UHS_REG_TRFC_CYCLE_LEN     (8U)
#define PSRAM_UHS_REG_TRFC_CYCLE_MSK     (((1U << PSRAM_UHS_REG_TRFC_CYCLE_LEN) - 1) << PSRAM_UHS_REG_TRFC_CYCLE_POS)
#define PSRAM_UHS_REG_TRFC_CYCLE_UMSK    (~(((1U << PSRAM_UHS_REG_TRFC_CYCLE_LEN) - 1) << PSRAM_UHS_REG_TRFC_CYCLE_POS))

/* 0x34 : UHS_rsvd_reg */
#define PSRAM_UHS_UHS_RSVD_REG_OFFSET (0x34)
#define PSRAM_UHS_REG_MR0_7           PSRAM_UHS_REG_MR0_7
#define PSRAM_UHS_REG_MR0_7_POS       (0U)
#define PSRAM_UHS_REG_MR0_7_LEN       (1U)
#define PSRAM_UHS_REG_MR0_7_MSK       (((1U << PSRAM_UHS_REG_MR0_7_LEN) - 1) << PSRAM_UHS_REG_MR0_7_POS)
#define PSRAM_UHS_REG_MR0_7_UMSK      (~(((1U << PSRAM_UHS_REG_MR0_7_LEN) - 1) << PSRAM_UHS_REG_MR0_7_POS))
#define PSRAM_UHS_REG_MR2_2_0         PSRAM_UHS_REG_MR2_2_0
#define PSRAM_UHS_REG_MR2_2_0_POS     (1U)
#define PSRAM_UHS_REG_MR2_2_0_LEN     (3U)
#define PSRAM_UHS_REG_MR2_2_0_MSK     (((1U << PSRAM_UHS_REG_MR2_2_0_LEN) - 1) << PSRAM_UHS_REG_MR2_2_0_POS)
#define PSRAM_UHS_REG_MR2_2_0_UMSK    (~(((1U << PSRAM_UHS_REG_MR2_2_0_LEN) - 1) << PSRAM_UHS_REG_MR2_2_0_POS))
#define PSRAM_UHS_REG_MR2_7_6         PSRAM_UHS_REG_MR2_7_6
#define PSRAM_UHS_REG_MR2_7_6_POS     (4U)
#define PSRAM_UHS_REG_MR2_7_6_LEN     (2U)
#define PSRAM_UHS_REG_MR2_7_6_MSK     (((1U << PSRAM_UHS_REG_MR2_7_6_LEN) - 1) << PSRAM_UHS_REG_MR2_7_6_POS)
#define PSRAM_UHS_REG_MR2_7_6_UMSK    (~(((1U << PSRAM_UHS_REG_MR2_7_6_LEN) - 1) << PSRAM_UHS_REG_MR2_7_6_POS))

/* 0xC0 : UHS_dbg_sel */
#define PSRAM_UHS_UHS_DBG_SEL_OFFSET     (0xC0)
#define PSRAM_UHS_REG_PSRAM_DBG_EN       PSRAM_UHS_REG_PSRAM_DBG_EN
#define PSRAM_UHS_REG_PSRAM_DBG_EN_POS   (0U)
#define PSRAM_UHS_REG_PSRAM_DBG_EN_LEN   (1U)
#define PSRAM_UHS_REG_PSRAM_DBG_EN_MSK   (((1U << PSRAM_UHS_REG_PSRAM_DBG_EN_LEN) - 1) << PSRAM_UHS_REG_PSRAM_DBG_EN_POS)
#define PSRAM_UHS_REG_PSRAM_DBG_EN_UMSK  (~(((1U << PSRAM_UHS_REG_PSRAM_DBG_EN_LEN) - 1) << PSRAM_UHS_REG_PSRAM_DBG_EN_POS))
#define PSRAM_UHS_REG_PSRAM_DBG_SEL      PSRAM_UHS_REG_PSRAM_DBG_SEL
#define PSRAM_UHS_REG_PSRAM_DBG_SEL_POS  (4U)
#define PSRAM_UHS_REG_PSRAM_DBG_SEL_LEN  (4U)
#define PSRAM_UHS_REG_PSRAM_DBG_SEL_MSK  (((1U << PSRAM_UHS_REG_PSRAM_DBG_SEL_LEN) - 1) << PSRAM_UHS_REG_PSRAM_DBG_SEL_POS)
#define PSRAM_UHS_REG_PSRAM_DBG_SEL_UMSK (~(((1U << PSRAM_UHS_REG_PSRAM_DBG_SEL_LEN) - 1) << PSRAM_UHS_REG_PSRAM_DBG_SEL_POS))

/* 0xF0 : UHS_dummy_reg */
#define PSRAM_UHS_UHS_DUMMY_REG_OFFSET     (0xF0)
#define PSRAM_UHS_REG_PSRAM_DUMMY_REG      PSRAM_UHS_REG_PSRAM_DUMMY_REG
#define PSRAM_UHS_REG_PSRAM_DUMMY_REG_POS  (0U)
#define PSRAM_UHS_REG_PSRAM_DUMMY_REG_LEN  (32U)
#define PSRAM_UHS_REG_PSRAM_DUMMY_REG_MSK  (((1U << PSRAM_UHS_REG_PSRAM_DUMMY_REG_LEN) - 1) << PSRAM_UHS_REG_PSRAM_DUMMY_REG_POS)
#define PSRAM_UHS_REG_PSRAM_DUMMY_REG_UMSK (~(((1U << PSRAM_UHS_REG_PSRAM_DUMMY_REG_LEN) - 1) << PSRAM_UHS_REG_PSRAM_DUMMY_REG_POS))

/* 0x100 : phy_cfg_00 */
#define PSRAM_UHS_PHY_CFG_00_OFFSET  (0x100)
#define PSRAM_UHS_DQS_RDY            PSRAM_UHS_DQS_RDY
#define PSRAM_UHS_DQS_RDY_POS        (0U)
#define PSRAM_UHS_DQS_RDY_LEN        (1U)
#define PSRAM_UHS_DQS_RDY_MSK        (((1U << PSRAM_UHS_DQS_RDY_LEN) - 1) << PSRAM_UHS_DQS_RDY_POS)
#define PSRAM_UHS_DQS_RDY_UMSK       (~(((1U << PSRAM_UHS_DQS_RDY_LEN) - 1) << PSRAM_UHS_DQS_RDY_POS))
#define PSRAM_UHS_CK_SR              PSRAM_UHS_CK_SR
#define PSRAM_UHS_CK_SR_POS          (8U)
#define PSRAM_UHS_CK_SR_LEN          (2U)
#define PSRAM_UHS_CK_SR_MSK          (((1U << PSRAM_UHS_CK_SR_LEN) - 1) << PSRAM_UHS_CK_SR_POS)
#define PSRAM_UHS_CK_SR_UMSK         (~(((1U << PSRAM_UHS_CK_SR_LEN) - 1) << PSRAM_UHS_CK_SR_POS))
#define PSRAM_UHS_CLK0_POLARITY      PSRAM_UHS_CLK0_POLARITY
#define PSRAM_UHS_CLK0_POLARITY_POS  (15U)
#define PSRAM_UHS_CLK0_POLARITY_LEN  (1U)
#define PSRAM_UHS_CLK0_POLARITY_MSK  (((1U << PSRAM_UHS_CLK0_POLARITY_LEN) - 1) << PSRAM_UHS_CLK0_POLARITY_POS)
#define PSRAM_UHS_CLK0_POLARITY_UMSK (~(((1U << PSRAM_UHS_CLK0_POLARITY_LEN) - 1) << PSRAM_UHS_CLK0_POLARITY_POS))
#define PSRAM_UHS_CK_DLY_DRV         PSRAM_UHS_CK_DLY_DRV
#define PSRAM_UHS_CK_DLY_DRV_POS     (16U)
#define PSRAM_UHS_CK_DLY_DRV_LEN     (4U)
#define PSRAM_UHS_CK_DLY_DRV_MSK     (((1U << PSRAM_UHS_CK_DLY_DRV_LEN) - 1) << PSRAM_UHS_CK_DLY_DRV_POS)
#define PSRAM_UHS_CK_DLY_DRV_UMSK    (~(((1U << PSRAM_UHS_CK_DLY_DRV_LEN) - 1) << PSRAM_UHS_CK_DLY_DRV_POS))
#define PSRAM_UHS_CEN_SR             PSRAM_UHS_CEN_SR
#define PSRAM_UHS_CEN_SR_POS         (20U)
#define PSRAM_UHS_CEN_SR_LEN         (2U)
#define PSRAM_UHS_CEN_SR_MSK         (((1U << PSRAM_UHS_CEN_SR_LEN) - 1) << PSRAM_UHS_CEN_SR_POS)
#define PSRAM_UHS_CEN_SR_UMSK        (~(((1U << PSRAM_UHS_CEN_SR_LEN) - 1) << PSRAM_UHS_CEN_SR_POS))
#define PSRAM_UHS_CEN_DLY_DRV        PSRAM_UHS_CEN_DLY_DRV
#define PSRAM_UHS_CEN_DLY_DRV_POS    (28U)
#define PSRAM_UHS_CEN_DLY_DRV_LEN    (4U)
#define PSRAM_UHS_CEN_DLY_DRV_MSK    (((1U << PSRAM_UHS_CEN_DLY_DRV_LEN) - 1) << PSRAM_UHS_CEN_DLY_DRV_POS)
#define PSRAM_UHS_CEN_DLY_DRV_UMSK   (~(((1U << PSRAM_UHS_CEN_DLY_DRV_LEN) - 1) << PSRAM_UHS_CEN_DLY_DRV_POS))

/* 0x104 : phy_cfg_04 */
#define PSRAM_UHS_PHY_CFG_04_OFFSET (0x104)
#define PSRAM_UHS_DM1_SR            PSRAM_UHS_DM1_SR
#define PSRAM_UHS_DM1_SR_POS        (4U)
#define PSRAM_UHS_DM1_SR_LEN        (2U)
#define PSRAM_UHS_DM1_SR_MSK        (((1U << PSRAM_UHS_DM1_SR_LEN) - 1) << PSRAM_UHS_DM1_SR_POS)
#define PSRAM_UHS_DM1_SR_UMSK       (~(((1U << PSRAM_UHS_DM1_SR_LEN) - 1) << PSRAM_UHS_DM1_SR_POS))
#define PSRAM_UHS_DM1_DLY_DRV       PSRAM_UHS_DM1_DLY_DRV
#define PSRAM_UHS_DM1_DLY_DRV_POS   (12U)
#define PSRAM_UHS_DM1_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DM1_DLY_DRV_MSK   (((1U << PSRAM_UHS_DM1_DLY_DRV_LEN) - 1) << PSRAM_UHS_DM1_DLY_DRV_POS)
#define PSRAM_UHS_DM1_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DM1_DLY_DRV_LEN) - 1) << PSRAM_UHS_DM1_DLY_DRV_POS))
#define PSRAM_UHS_DM0_SR            PSRAM_UHS_DM0_SR
#define PSRAM_UHS_DM0_SR_POS        (20U)
#define PSRAM_UHS_DM0_SR_LEN        (2U)
#define PSRAM_UHS_DM0_SR_MSK        (((1U << PSRAM_UHS_DM0_SR_LEN) - 1) << PSRAM_UHS_DM0_SR_POS)
#define PSRAM_UHS_DM0_SR_UMSK       (~(((1U << PSRAM_UHS_DM0_SR_LEN) - 1) << PSRAM_UHS_DM0_SR_POS))
#define PSRAM_UHS_DM0_DLY_DRV       PSRAM_UHS_DM0_DLY_DRV
#define PSRAM_UHS_DM0_DLY_DRV_POS   (28U)
#define PSRAM_UHS_DM0_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DM0_DLY_DRV_MSK   (((1U << PSRAM_UHS_DM0_DLY_DRV_LEN) - 1) << PSRAM_UHS_DM0_DLY_DRV_POS)
#define PSRAM_UHS_DM0_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DM0_DLY_DRV_LEN) - 1) << PSRAM_UHS_DM0_DLY_DRV_POS))

