RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/psram_uhs_reg.h
/* 0x108 : phy_cfg_08 */
#define PSRAM_UHS_PHY_CFG_08_OFFSET (0x108)
#define PSRAM_UHS_DQ1_SR            PSRAM_UHS_DQ1_SR
#define PSRAM_UHS_DQ1_SR_POS        (0U)
#define PSRAM_UHS_DQ1_SR_LEN        (2U)
#define PSRAM_UHS_DQ1_SR_MSK        (((1U << PSRAM_UHS_DQ1_SR_LEN) - 1) << PSRAM_UHS_DQ1_SR_POS)
#define PSRAM_UHS_DQ1_SR_UMSK       (~(((1U << PSRAM_UHS_DQ1_SR_LEN) - 1) << PSRAM_UHS_DQ1_SR_POS))
#define PSRAM_UHS_DQ1_DLY_RX        PSRAM_UHS_DQ1_DLY_RX
#define PSRAM_UHS_DQ1_DLY_RX_POS    (8U)
#define PSRAM_UHS_DQ1_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ1_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ1_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ1_DLY_RX_POS)
#define PSRAM_UHS_DQ1_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ1_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ1_DLY_RX_POS))
#define PSRAM_UHS_DQ1_DLY_DRV       PSRAM_UHS_DQ1_DLY_DRV
#define PSRAM_UHS_DQ1_DLY_DRV_POS   (12U)
#define PSRAM_UHS_DQ1_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ1_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ1_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ1_DLY_DRV_POS)
#define PSRAM_UHS_DQ1_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ1_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ1_DLY_DRV_POS))
#define PSRAM_UHS_DQ0_SR            PSRAM_UHS_DQ0_SR
#define PSRAM_UHS_DQ0_SR_POS        (16U)
#define PSRAM_UHS_DQ0_SR_LEN        (2U)
#define PSRAM_UHS_DQ0_SR_MSK        (((1U << PSRAM_UHS_DQ0_SR_LEN) - 1) << PSRAM_UHS_DQ0_SR_POS)
#define PSRAM_UHS_DQ0_SR_UMSK       (~(((1U << PSRAM_UHS_DQ0_SR_LEN) - 1) << PSRAM_UHS_DQ0_SR_POS))
#define PSRAM_UHS_DQ0_DLY_RX        PSRAM_UHS_DQ0_DLY_RX
#define PSRAM_UHS_DQ0_DLY_RX_POS    (24U)
#define PSRAM_UHS_DQ0_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ0_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ0_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ0_DLY_RX_POS)
#define PSRAM_UHS_DQ0_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ0_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ0_DLY_RX_POS))
#define PSRAM_UHS_DQ0_DLY_DRV       PSRAM_UHS_DQ0_DLY_DRV
#define PSRAM_UHS_DQ0_DLY_DRV_POS   (28U)
#define PSRAM_UHS_DQ0_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ0_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ0_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ0_DLY_DRV_POS)
#define PSRAM_UHS_DQ0_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ0_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ0_DLY_DRV_POS))

/* 0x10C : phy_cfg_0C */
#define PSRAM_UHS_PHY_CFG_0C_OFFSET (0x10C)
#define PSRAM_UHS_DQ3_SR            PSRAM_UHS_DQ3_SR
#define PSRAM_UHS_DQ3_SR_POS        (0U)
#define PSRAM_UHS_DQ3_SR_LEN        (2U)
#define PSRAM_UHS_DQ3_SR_MSK        (((1U << PSRAM_UHS_DQ3_SR_LEN) - 1) << PSRAM_UHS_DQ3_SR_POS)
#define PSRAM_UHS_DQ3_SR_UMSK       (~(((1U << PSRAM_UHS_DQ3_SR_LEN) - 1) << PSRAM_UHS_DQ3_SR_POS))
#define PSRAM_UHS_DQ3_DLY_RX        PSRAM_UHS_DQ3_DLY_RX
#define PSRAM_UHS_DQ3_DLY_RX_POS    (8U)
#define PSRAM_UHS_DQ3_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ3_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ3_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ3_DLY_RX_POS)
#define PSRAM_UHS_DQ3_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ3_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ3_DLY_RX_POS))
#define PSRAM_UHS_DQ3_DLY_DRV       PSRAM_UHS_DQ3_DLY_DRV
#define PSRAM_UHS_DQ3_DLY_DRV_POS   (12U)
#define PSRAM_UHS_DQ3_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ3_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ3_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ3_DLY_DRV_POS)
#define PSRAM_UHS_DQ3_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ3_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ3_DLY_DRV_POS))
#define PSRAM_UHS_DQ2_SR            PSRAM_UHS_DQ2_SR
#define PSRAM_UHS_DQ2_SR_POS        (16U)
#define PSRAM_UHS_DQ2_SR_LEN        (2U)
#define PSRAM_UHS_DQ2_SR_MSK        (((1U << PSRAM_UHS_DQ2_SR_LEN) - 1) << PSRAM_UHS_DQ2_SR_POS)
#define PSRAM_UHS_DQ2_SR_UMSK       (~(((1U << PSRAM_UHS_DQ2_SR_LEN) - 1) << PSRAM_UHS_DQ2_SR_POS))
#define PSRAM_UHS_DQ2_DLY_RX        PSRAM_UHS_DQ2_DLY_RX
#define PSRAM_UHS_DQ2_DLY_RX_POS    (24U)
#define PSRAM_UHS_DQ2_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ2_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ2_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ2_DLY_RX_POS)
#define PSRAM_UHS_DQ2_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ2_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ2_DLY_RX_POS))
#define PSRAM_UHS_DQ2_DLY_DRV       PSRAM_UHS_DQ2_DLY_DRV
#define PSRAM_UHS_DQ2_DLY_DRV_POS   (28U)
#define PSRAM_UHS_DQ2_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ2_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ2_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ2_DLY_DRV_POS)
#define PSRAM_UHS_DQ2_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ2_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ2_DLY_DRV_POS))

/* 0x110 : phy_cfg_10 */
#define PSRAM_UHS_PHY_CFG_10_OFFSET (0x110)
#define PSRAM_UHS_DQ5_SR            PSRAM_UHS_DQ5_SR
#define PSRAM_UHS_DQ5_SR_POS        (0U)
#define PSRAM_UHS_DQ5_SR_LEN        (2U)
#define PSRAM_UHS_DQ5_SR_MSK        (((1U << PSRAM_UHS_DQ5_SR_LEN) - 1) << PSRAM_UHS_DQ5_SR_POS)
#define PSRAM_UHS_DQ5_SR_UMSK       (~(((1U << PSRAM_UHS_DQ5_SR_LEN) - 1) << PSRAM_UHS_DQ5_SR_POS))
#define PSRAM_UHS_DQ5_DLY_RX        PSRAM_UHS_DQ5_DLY_RX
#define PSRAM_UHS_DQ5_DLY_RX_POS    (8U)
#define PSRAM_UHS_DQ5_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ5_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ5_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ5_DLY_RX_POS)
#define PSRAM_UHS_DQ5_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ5_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ5_DLY_RX_POS))
#define PSRAM_UHS_DQ5_DLY_DRV       PSRAM_UHS_DQ5_DLY_DRV
#define PSRAM_UHS_DQ5_DLY_DRV_POS   (12U)
#define PSRAM_UHS_DQ5_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ5_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ5_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ5_DLY_DRV_POS)
#define PSRAM_UHS_DQ5_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ5_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ5_DLY_DRV_POS))
#define PSRAM_UHS_DQ4_SR            PSRAM_UHS_DQ4_SR
#define PSRAM_UHS_DQ4_SR_POS        (16U)
#define PSRAM_UHS_DQ4_SR_LEN        (2U)
#define PSRAM_UHS_DQ4_SR_MSK        (((1U << PSRAM_UHS_DQ4_SR_LEN) - 1) << PSRAM_UHS_DQ4_SR_POS)
#define PSRAM_UHS_DQ4_SR_UMSK       (~(((1U << PSRAM_UHS_DQ4_SR_LEN) - 1) << PSRAM_UHS_DQ4_SR_POS))
#define PSRAM_UHS_DQ4_DLY_RX        PSRAM_UHS_DQ4_DLY_RX
#define PSRAM_UHS_DQ4_DLY_RX_POS    (24U)
#define PSRAM_UHS_DQ4_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ4_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ4_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ4_DLY_RX_POS)
#define PSRAM_UHS_DQ4_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ4_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ4_DLY_RX_POS))
#define PSRAM_UHS_DQ4_DLY_DRV       PSRAM_UHS_DQ4_DLY_DRV
#define PSRAM_UHS_DQ4_DLY_DRV_POS   (28U)
#define PSRAM_UHS_DQ4_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ4_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ4_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ4_DLY_DRV_POS)
#define PSRAM_UHS_DQ4_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ4_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ4_DLY_DRV_POS))

