RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/psram_uhs_reg.h
/* 0x114 : phy_cfg_14 */
#define PSRAM_UHS_PHY_CFG_14_OFFSET (0x114)
#define PSRAM_UHS_DQ7_SR            PSRAM_UHS_DQ7_SR
#define PSRAM_UHS_DQ7_SR_POS        (0U)
#define PSRAM_UHS_DQ7_SR_LEN        (2U)
#define PSRAM_UHS_DQ7_SR_MSK        (((1U << PSRAM_UHS_DQ7_SR_LEN) - 1) << PSRAM_UHS_DQ7_SR_POS)
#define PSRAM_UHS_DQ7_SR_UMSK       (~(((1U << PSRAM_UHS_DQ7_SR_LEN) - 1) << PSRAM_UHS_DQ7_SR_POS))
#define PSRAM_UHS_DQ7_DLY_RX        PSRAM_UHS_DQ7_DLY_RX
#define PSRAM_UHS_DQ7_DLY_RX_POS    (8U)
#define PSRAM_UHS_DQ7_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ7_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ7_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ7_DLY_RX_POS)
#define PSRAM_UHS_DQ7_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ7_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ7_DLY_RX_POS))
#define PSRAM_UHS_DQ7_DLY_DRV       PSRAM_UHS_DQ7_DLY_DRV
#define PSRAM_UHS_DQ7_DLY_DRV_POS   (12U)
#define PSRAM_UHS_DQ7_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ7_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ7_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ7_DLY_DRV_POS)
#define PSRAM_UHS_DQ7_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ7_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ7_DLY_DRV_POS))
#define PSRAM_UHS_DQ6_SR            PSRAM_UHS_DQ6_SR
#define PSRAM_UHS_DQ6_SR_POS        (16U)
#define PSRAM_UHS_DQ6_SR_LEN        (2U)
#define PSRAM_UHS_DQ6_SR_MSK        (((1U << PSRAM_UHS_DQ6_SR_LEN) - 1) << PSRAM_UHS_DQ6_SR_POS)
#define PSRAM_UHS_DQ6_SR_UMSK       (~(((1U << PSRAM_UHS_DQ6_SR_LEN) - 1) << PSRAM_UHS_DQ6_SR_POS))
#define PSRAM_UHS_DQ6_DLY_RX        PSRAM_UHS_DQ6_DLY_RX
#define PSRAM_UHS_DQ6_DLY_RX_POS    (24U)
#define PSRAM_UHS_DQ6_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ6_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ6_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ6_DLY_RX_POS)
#define PSRAM_UHS_DQ6_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ6_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ6_DLY_RX_POS))
#define PSRAM_UHS_DQ6_DLY_DRV       PSRAM_UHS_DQ6_DLY_DRV
#define PSRAM_UHS_DQ6_DLY_DRV_POS   (28U)
#define PSRAM_UHS_DQ6_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ6_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ6_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ6_DLY_DRV_POS)
#define PSRAM_UHS_DQ6_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ6_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ6_DLY_DRV_POS))

/* 0x118 : phy_cfg_18 */
#define PSRAM_UHS_PHY_CFG_18_OFFSET (0x118)
#define PSRAM_UHS_DQ9_SR            PSRAM_UHS_DQ9_SR
#define PSRAM_UHS_DQ9_SR_POS        (0U)
#define PSRAM_UHS_DQ9_SR_LEN        (2U)
#define PSRAM_UHS_DQ9_SR_MSK        (((1U << PSRAM_UHS_DQ9_SR_LEN) - 1) << PSRAM_UHS_DQ9_SR_POS)
#define PSRAM_UHS_DQ9_SR_UMSK       (~(((1U << PSRAM_UHS_DQ9_SR_LEN) - 1) << PSRAM_UHS_DQ9_SR_POS))
#define PSRAM_UHS_DQ9_DLY_RX        PSRAM_UHS_DQ9_DLY_RX
#define PSRAM_UHS_DQ9_DLY_RX_POS    (8U)
#define PSRAM_UHS_DQ9_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ9_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ9_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ9_DLY_RX_POS)
#define PSRAM_UHS_DQ9_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ9_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ9_DLY_RX_POS))
#define PSRAM_UHS_DQ9_DLY_DRV       PSRAM_UHS_DQ9_DLY_DRV
#define PSRAM_UHS_DQ9_DLY_DRV_POS   (12U)
#define PSRAM_UHS_DQ9_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ9_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ9_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ9_DLY_DRV_POS)
#define PSRAM_UHS_DQ9_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ9_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ9_DLY_DRV_POS))
#define PSRAM_UHS_DQ8_SR            PSRAM_UHS_DQ8_SR
#define PSRAM_UHS_DQ8_SR_POS        (16U)
#define PSRAM_UHS_DQ8_SR_LEN        (2U)
#define PSRAM_UHS_DQ8_SR_MSK        (((1U << PSRAM_UHS_DQ8_SR_LEN) - 1) << PSRAM_UHS_DQ8_SR_POS)
#define PSRAM_UHS_DQ8_SR_UMSK       (~(((1U << PSRAM_UHS_DQ8_SR_LEN) - 1) << PSRAM_UHS_DQ8_SR_POS))
#define PSRAM_UHS_DQ8_DLY_RX        PSRAM_UHS_DQ8_DLY_RX
#define PSRAM_UHS_DQ8_DLY_RX_POS    (24U)
#define PSRAM_UHS_DQ8_DLY_RX_LEN    (4U)
#define PSRAM_UHS_DQ8_DLY_RX_MSK    (((1U << PSRAM_UHS_DQ8_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ8_DLY_RX_POS)
#define PSRAM_UHS_DQ8_DLY_RX_UMSK   (~(((1U << PSRAM_UHS_DQ8_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ8_DLY_RX_POS))
#define PSRAM_UHS_DQ8_DLY_DRV       PSRAM_UHS_DQ8_DLY_DRV
#define PSRAM_UHS_DQ8_DLY_DRV_POS   (28U)
#define PSRAM_UHS_DQ8_DLY_DRV_LEN   (4U)
#define PSRAM_UHS_DQ8_DLY_DRV_MSK   (((1U << PSRAM_UHS_DQ8_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ8_DLY_DRV_POS)
#define PSRAM_UHS_DQ8_DLY_DRV_UMSK  (~(((1U << PSRAM_UHS_DQ8_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ8_DLY_DRV_POS))

/* 0x11C : phy_cfg_1C */
#define PSRAM_UHS_PHY_CFG_1C_OFFSET (0x11C)
#define PSRAM_UHS_DQ11_SR           PSRAM_UHS_DQ11_SR
#define PSRAM_UHS_DQ11_SR_POS       (0U)
#define PSRAM_UHS_DQ11_SR_LEN       (2U)
#define PSRAM_UHS_DQ11_SR_MSK       (((1U << PSRAM_UHS_DQ11_SR_LEN) - 1) << PSRAM_UHS_DQ11_SR_POS)
#define PSRAM_UHS_DQ11_SR_UMSK      (~(((1U << PSRAM_UHS_DQ11_SR_LEN) - 1) << PSRAM_UHS_DQ11_SR_POS))
#define PSRAM_UHS_DQ11_DLY_RX       PSRAM_UHS_DQ11_DLY_RX
#define PSRAM_UHS_DQ11_DLY_RX_POS   (8U)
#define PSRAM_UHS_DQ11_DLY_RX_LEN   (4U)
#define PSRAM_UHS_DQ11_DLY_RX_MSK   (((1U << PSRAM_UHS_DQ11_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ11_DLY_RX_POS)
#define PSRAM_UHS_DQ11_DLY_RX_UMSK  (~(((1U << PSRAM_UHS_DQ11_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ11_DLY_RX_POS))
#define PSRAM_UHS_DQ11_DLY_DRV      PSRAM_UHS_DQ11_DLY_DRV
#define PSRAM_UHS_DQ11_DLY_DRV_POS  (12U)
#define PSRAM_UHS_DQ11_DLY_DRV_LEN  (4U)
#define PSRAM_UHS_DQ11_DLY_DRV_MSK  (((1U << PSRAM_UHS_DQ11_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ11_DLY_DRV_POS)
#define PSRAM_UHS_DQ11_DLY_DRV_UMSK (~(((1U << PSRAM_UHS_DQ11_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ11_DLY_DRV_POS))
#define PSRAM_UHS_DQ10_SR           PSRAM_UHS_DQ10_SR
#define PSRAM_UHS_DQ10_SR_POS       (16U)
#define PSRAM_UHS_DQ10_SR_LEN       (2U)
#define PSRAM_UHS_DQ10_SR_MSK       (((1U << PSRAM_UHS_DQ10_SR_LEN) - 1) << PSRAM_UHS_DQ10_SR_POS)
#define PSRAM_UHS_DQ10_SR_UMSK      (~(((1U << PSRAM_UHS_DQ10_SR_LEN) - 1) << PSRAM_UHS_DQ10_SR_POS))
#define PSRAM_UHS_DQ10_DLY_RX       PSRAM_UHS_DQ10_DLY_RX
#define PSRAM_UHS_DQ10_DLY_RX_POS   (24U)
#define PSRAM_UHS_DQ10_DLY_RX_LEN   (4U)
#define PSRAM_UHS_DQ10_DLY_RX_MSK   (((1U << PSRAM_UHS_DQ10_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ10_DLY_RX_POS)
#define PSRAM_UHS_DQ10_DLY_RX_UMSK  (~(((1U << PSRAM_UHS_DQ10_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ10_DLY_RX_POS))
#define PSRAM_UHS_DQ10_DLY_DRV      PSRAM_UHS_DQ10_DLY_DRV
#define PSRAM_UHS_DQ10_DLY_DRV_POS  (28U)
#define PSRAM_UHS_DQ10_DLY_DRV_LEN  (4U)
#define PSRAM_UHS_DQ10_DLY_DRV_MSK  (((1U << PSRAM_UHS_DQ10_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ10_DLY_DRV_POS)
#define PSRAM_UHS_DQ10_DLY_DRV_UMSK (~(((1U << PSRAM_UHS_DQ10_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ10_DLY_DRV_POS))

/* 0x120 : phy_cfg_20 */
#define PSRAM_UHS_PHY_CFG_20_OFFSET (0x120)
#define PSRAM_UHS_DQ13_SR           PSRAM_UHS_DQ13_SR
#define PSRAM_UHS_DQ13_SR_POS       (0U)
#define PSRAM_UHS_DQ13_SR_LEN       (2U)
#define PSRAM_UHS_DQ13_SR_MSK       (((1U << PSRAM_UHS_DQ13_SR_LEN) - 1) << PSRAM_UHS_DQ13_SR_POS)
#define PSRAM_UHS_DQ13_SR_UMSK      (~(((1U << PSRAM_UHS_DQ13_SR_LEN) - 1) << PSRAM_UHS_DQ13_SR_POS))
#define PSRAM_UHS_DQ13_DLY_RX       PSRAM_UHS_DQ13_DLY_RX
#define PSRAM_UHS_DQ13_DLY_RX_POS   (8U)
#define PSRAM_UHS_DQ13_DLY_RX_LEN   (4U)
#define PSRAM_UHS_DQ13_DLY_RX_MSK   (((1U << PSRAM_UHS_DQ13_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ13_DLY_RX_POS)
#define PSRAM_UHS_DQ13_DLY_RX_UMSK  (~(((1U << PSRAM_UHS_DQ13_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ13_DLY_RX_POS))
#define PSRAM_UHS_DQ13_DLY_DRV      PSRAM_UHS_DQ13_DLY_DRV
#define PSRAM_UHS_DQ13_DLY_DRV_POS  (12U)
#define PSRAM_UHS_DQ13_DLY_DRV_LEN  (4U)
#define PSRAM_UHS_DQ13_DLY_DRV_MSK  (((1U << PSRAM_UHS_DQ13_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ13_DLY_DRV_POS)
#define PSRAM_UHS_DQ13_DLY_DRV_UMSK (~(((1U << PSRAM_UHS_DQ13_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ13_DLY_DRV_POS))
#define PSRAM_UHS_DQ12_SR           PSRAM_UHS_DQ12_SR
#define PSRAM_UHS_DQ12_SR_POS       (16U)
#define PSRAM_UHS_DQ12_SR_LEN       (2U)
#define PSRAM_UHS_DQ12_SR_MSK       (((1U << PSRAM_UHS_DQ12_SR_LEN) - 1) << PSRAM_UHS_DQ12_SR_POS)
#define PSRAM_UHS_DQ12_SR_UMSK      (~(((1U << PSRAM_UHS_DQ12_SR_LEN) - 1) << PSRAM_UHS_DQ12_SR_POS))
#define PSRAM_UHS_DQ12_DLY_RX       PSRAM_UHS_DQ12_DLY_RX
#define PSRAM_UHS_DQ12_DLY_RX_POS   (24U)
#define PSRAM_UHS_DQ12_DLY_RX_LEN   (4U)
#define PSRAM_UHS_DQ12_DLY_RX_MSK   (((1U << PSRAM_UHS_DQ12_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ12_DLY_RX_POS)
#define PSRAM_UHS_DQ12_DLY_RX_UMSK  (~(((1U << PSRAM_UHS_DQ12_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ12_DLY_RX_POS))
#define PSRAM_UHS_DQ12_DLY_DRV      PSRAM_UHS_DQ12_DLY_DRV
#define PSRAM_UHS_DQ12_DLY_DRV_POS  (28U)
#define PSRAM_UHS_DQ12_DLY_DRV_LEN  (4U)
#define PSRAM_UHS_DQ12_DLY_DRV_MSK  (((1U << PSRAM_UHS_DQ12_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ12_DLY_DRV_POS)
#define PSRAM_UHS_DQ12_DLY_DRV_UMSK (~(((1U << PSRAM_UHS_DQ12_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ12_DLY_DRV_POS))

/* 0x124 : phy_cfg_24 */
#define PSRAM_UHS_PHY_CFG_24_OFFSET (0x124)
#define PSRAM_UHS_DQ15_SR           PSRAM_UHS_DQ15_SR
#define PSRAM_UHS_DQ15_SR_POS       (0U)
#define PSRAM_UHS_DQ15_SR_LEN       (2U)
#define PSRAM_UHS_DQ15_SR_MSK       (((1U << PSRAM_UHS_DQ15_SR_LEN) - 1) << PSRAM_UHS_DQ15_SR_POS)
#define PSRAM_UHS_DQ15_SR_UMSK      (~(((1U << PSRAM_UHS_DQ15_SR_LEN) - 1) << PSRAM_UHS_DQ15_SR_POS))
#define PSRAM_UHS_DQ15_DLY_RX       PSRAM_UHS_DQ15_DLY_RX
#define PSRAM_UHS_DQ15_DLY_RX_POS   (8U)
#define PSRAM_UHS_DQ15_DLY_RX_LEN   (4U)
#define PSRAM_UHS_DQ15_DLY_RX_MSK   (((1U << PSRAM_UHS_DQ15_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ15_DLY_RX_POS)
#define PSRAM_UHS_DQ15_DLY_RX_UMSK  (~(((1U << PSRAM_UHS_DQ15_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ15_DLY_RX_POS))
#define PSRAM_UHS_DQ15_DLY_DRV      PSRAM_UHS_DQ15_DLY_DRV
#define PSRAM_UHS_DQ15_DLY_DRV_POS  (12U)
#define PSRAM_UHS_DQ15_DLY_DRV_LEN  (4U)
#define PSRAM_UHS_DQ15_DLY_DRV_MSK  (((1U << PSRAM_UHS_DQ15_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ15_DLY_DRV_POS)
#define PSRAM_UHS_DQ15_DLY_DRV_UMSK (~(((1U << PSRAM_UHS_DQ15_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ15_DLY_DRV_POS))
#define PSRAM_UHS_DQ14_SR           PSRAM_UHS_DQ14_SR
#define PSRAM_UHS_DQ14_SR_POS       (16U)
#define PSRAM_UHS_DQ14_SR_LEN       (2U)
#define PSRAM_UHS_DQ14_SR_MSK       (((1U << PSRAM_UHS_DQ14_SR_LEN) - 1) << PSRAM_UHS_DQ14_SR_POS)
#define PSRAM_UHS_DQ14_SR_UMSK      (~(((1U << PSRAM_UHS_DQ14_SR_LEN) - 1) << PSRAM_UHS_DQ14_SR_POS))
#define PSRAM_UHS_DQ14_DLY_RX       PSRAM_UHS_DQ14_DLY_RX
#define PSRAM_UHS_DQ14_DLY_RX_POS   (24U)
#define PSRAM_UHS_DQ14_DLY_RX_LEN   (4U)
#define PSRAM_UHS_DQ14_DLY_RX_MSK   (((1U << PSRAM_UHS_DQ14_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ14_DLY_RX_POS)
#define PSRAM_UHS_DQ14_DLY_RX_UMSK  (~(((1U << PSRAM_UHS_DQ14_DLY_RX_LEN) - 1) << PSRAM_UHS_DQ14_DLY_RX_POS))
#define PSRAM_UHS_DQ14_DLY_DRV      PSRAM_UHS_DQ14_DLY_DRV
#define PSRAM_UHS_DQ14_DLY_DRV_POS  (28U)
#define PSRAM_UHS_DQ14_DLY_DRV_LEN  (4U)
#define PSRAM_UHS_DQ14_DLY_DRV_MSK  (((1U << PSRAM_UHS_DQ14_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ14_DLY_DRV_POS)
#define PSRAM_UHS_DQ14_DLY_DRV_UMSK (~(((1U << PSRAM_UHS_DQ14_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQ14_DLY_DRV_POS))

/* 0x128 : phy_cfg_28 */
#define PSRAM_UHS_PHY_CFG_28_OFFSET     (0x128)
#define PSRAM_UHS_DQS0N_DLY_RX          PSRAM_UHS_DQS0N_DLY_RX
#define PSRAM_UHS_DQS0N_DLY_RX_POS      (8U)
#define PSRAM_UHS_DQS0N_DLY_RX_LEN      (4U)
#define PSRAM_UHS_DQS0N_DLY_RX_MSK      (((1U << PSRAM_UHS_DQS0N_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS0N_DLY_RX_POS)
#define PSRAM_UHS_DQS0N_DLY_RX_UMSK     (~(((1U << PSRAM_UHS_DQS0N_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS0N_DLY_RX_POS))
#define PSRAM_UHS_DQS0_SR               PSRAM_UHS_DQS0_SR
#define PSRAM_UHS_DQS0_SR_POS           (12U)
#define PSRAM_UHS_DQS0_SR_LEN           (2U)
#define PSRAM_UHS_DQS0_SR_MSK           (((1U << PSRAM_UHS_DQS0_SR_LEN) - 1) << PSRAM_UHS_DQS0_SR_POS)
#define PSRAM_UHS_DQS0_SR_UMSK          (~(((1U << PSRAM_UHS_DQS0_SR_LEN) - 1) << PSRAM_UHS_DQS0_SR_POS))
#define PSRAM_UHS_DQS0_SEL              PSRAM_UHS_DQS0_SEL
#define PSRAM_UHS_DQS0_SEL_POS          (14U)
#define PSRAM_UHS_DQS0_SEL_LEN          (2U)
#define PSRAM_UHS_DQS0_SEL_MSK          (((1U << PSRAM_UHS_DQS0_SEL_LEN) - 1) << PSRAM_UHS_DQS0_SEL_POS)
#define PSRAM_UHS_DQS0_SEL_UMSK         (~(((1U << PSRAM_UHS_DQS0_SEL_LEN) - 1) << PSRAM_UHS_DQS0_SEL_POS))
#define PSRAM_UHS_DQS0_DLY_RX           PSRAM_UHS_DQS0_DLY_RX
#define PSRAM_UHS_DQS0_DLY_RX_POS       (20U)
#define PSRAM_UHS_DQS0_DLY_RX_LEN       (4U)
#define PSRAM_UHS_DQS0_DLY_RX_MSK       (((1U << PSRAM_UHS_DQS0_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS0_DLY_RX_POS)
#define PSRAM_UHS_DQS0_DLY_RX_UMSK      (~(((1U << PSRAM_UHS_DQS0_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS0_DLY_RX_POS))
#define PSRAM_UHS_DQS0_DLY_DRV          PSRAM_UHS_DQS0_DLY_DRV
#define PSRAM_UHS_DQS0_DLY_DRV_POS      (24U)
#define PSRAM_UHS_DQS0_DLY_DRV_LEN      (4U)
#define PSRAM_UHS_DQS0_DLY_DRV_MSK      (((1U << PSRAM_UHS_DQS0_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQS0_DLY_DRV_POS)
#define PSRAM_UHS_DQS0_DLY_DRV_UMSK     (~(((1U << PSRAM_UHS_DQS0_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQS0_DLY_DRV_POS))
#define PSRAM_UHS_DQS0_DIFF_DLY_RX      PSRAM_UHS_DQS0_DIFF_DLY_RX
#define PSRAM_UHS_DQS0_DIFF_DLY_RX_POS  (28U)
#define PSRAM_UHS_DQS0_DIFF_DLY_RX_LEN  (4U)
#define PSRAM_UHS_DQS0_DIFF_DLY_RX_MSK  (((1U << PSRAM_UHS_DQS0_DIFF_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS0_DIFF_DLY_RX_POS)
#define PSRAM_UHS_DQS0_DIFF_DLY_RX_UMSK (~(((1U << PSRAM_UHS_DQS0_DIFF_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS0_DIFF_DLY_RX_POS))

/* 0x12C : phy_cfg_2C */
#define PSRAM_UHS_PHY_CFG_2C_OFFSET     (0x12C)
#define PSRAM_UHS_IPP5UN_LPDDR          PSRAM_UHS_IPP5UN_LPDDR
#define PSRAM_UHS_IPP5UN_LPDDR_POS      (0U)
#define PSRAM_UHS_IPP5UN_LPDDR_LEN      (1U)
#define PSRAM_UHS_IPP5UN_LPDDR_MSK      (((1U << PSRAM_UHS_IPP5UN_LPDDR_LEN) - 1) << PSRAM_UHS_IPP5UN_LPDDR_POS)
#define PSRAM_UHS_IPP5UN_LPDDR_UMSK     (~(((1U << PSRAM_UHS_IPP5UN_LPDDR_LEN) - 1) << PSRAM_UHS_IPP5UN_LPDDR_POS))
#define PSRAM_UHS_EN_RX_FE              PSRAM_UHS_EN_RX_FE
#define PSRAM_UHS_EN_RX_FE_POS          (1U)
#define PSRAM_UHS_EN_RX_FE_LEN          (1U)
#define PSRAM_UHS_EN_RX_FE_MSK          (((1U << PSRAM_UHS_EN_RX_FE_LEN) - 1) << PSRAM_UHS_EN_RX_FE_POS)
#define PSRAM_UHS_EN_RX_FE_UMSK         (~(((1U << PSRAM_UHS_EN_RX_FE_LEN) - 1) << PSRAM_UHS_EN_RX_FE_POS))
#define PSRAM_UHS_EN_BIAS               PSRAM_UHS_EN_BIAS
#define PSRAM_UHS_EN_BIAS_POS           (2U)
#define PSRAM_UHS_EN_BIAS_LEN           (1U)
#define PSRAM_UHS_EN_BIAS_MSK           (((1U << PSRAM_UHS_EN_BIAS_LEN) - 1) << PSRAM_UHS_EN_BIAS_POS)
#define PSRAM_UHS_EN_BIAS_UMSK          (~(((1U << PSRAM_UHS_EN_BIAS_LEN) - 1) << PSRAM_UHS_EN_BIAS_POS))
#define PSRAM_UHS_DQS1N_DLY_RX          PSRAM_UHS_DQS1N_DLY_RX
#define PSRAM_UHS_DQS1N_DLY_RX_POS      (8U)
#define PSRAM_UHS_DQS1N_DLY_RX_LEN      (4U)
#define PSRAM_UHS_DQS1N_DLY_RX_MSK      (((1U << PSRAM_UHS_DQS1N_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS1N_DLY_RX_POS)
#define PSRAM_UHS_DQS1N_DLY_RX_UMSK     (~(((1U << PSRAM_UHS_DQS1N_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS1N_DLY_RX_POS))
#define PSRAM_UHS_DQS1_SR               PSRAM_UHS_DQS1_SR
#define PSRAM_UHS_DQS1_SR_POS           (12U)
#define PSRAM_UHS_DQS1_SR_LEN           (2U)
#define PSRAM_UHS_DQS1_SR_MSK           (((1U << PSRAM_UHS_DQS1_SR_LEN) - 1) << PSRAM_UHS_DQS1_SR_POS)
#define PSRAM_UHS_DQS1_SR_UMSK          (~(((1U << PSRAM_UHS_DQS1_SR_LEN) - 1) << PSRAM_UHS_DQS1_SR_POS))
#define PSRAM_UHS_DQS1_SEL              PSRAM_UHS_DQS1_SEL
#define PSRAM_UHS_DQS1_SEL_POS          (14U)
#define PSRAM_UHS_DQS1_SEL_LEN          (2U)
#define PSRAM_UHS_DQS1_SEL_MSK          (((1U << PSRAM_UHS_DQS1_SEL_LEN) - 1) << PSRAM_UHS_DQS1_SEL_POS)
#define PSRAM_UHS_DQS1_SEL_UMSK         (~(((1U << PSRAM_UHS_DQS1_SEL_LEN) - 1) << PSRAM_UHS_DQS1_SEL_POS))
#define PSRAM_UHS_DQS1_DLY_RX           PSRAM_UHS_DQS1_DLY_RX
#define PSRAM_UHS_DQS1_DLY_RX_POS       (20U)
#define PSRAM_UHS_DQS1_DLY_RX_LEN       (4U)
#define PSRAM_UHS_DQS1_DLY_RX_MSK       (((1U << PSRAM_UHS_DQS1_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS1_DLY_RX_POS)
#define PSRAM_UHS_DQS1_DLY_RX_UMSK      (~(((1U << PSRAM_UHS_DQS1_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS1_DLY_RX_POS))
#define PSRAM_UHS_DQS1_DLY_DRV          PSRAM_UHS_DQS1_DLY_DRV
#define PSRAM_UHS_DQS1_DLY_DRV_POS      (24U)
#define PSRAM_UHS_DQS1_DLY_DRV_LEN      (4U)
#define PSRAM_UHS_DQS1_DLY_DRV_MSK      (((1U << PSRAM_UHS_DQS1_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQS1_DLY_DRV_POS)
#define PSRAM_UHS_DQS1_DLY_DRV_UMSK     (~(((1U << PSRAM_UHS_DQS1_DLY_DRV_LEN) - 1) << PSRAM_UHS_DQS1_DLY_DRV_POS))
#define PSRAM_UHS_DQS1_DIFF_DLY_RX      PSRAM_UHS_DQS1_DIFF_DLY_RX
#define PSRAM_UHS_DQS1_DIFF_DLY_RX_POS  (28U)
#define PSRAM_UHS_DQS1_DIFF_DLY_RX_LEN  (4U)
#define PSRAM_UHS_DQS1_DIFF_DLY_RX_MSK  (((1U << PSRAM_UHS_DQS1_DIFF_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS1_DIFF_DLY_RX_POS)
#define PSRAM_UHS_DQS1_DIFF_DLY_RX_UMSK (~(((1U << PSRAM_UHS_DQS1_DIFF_DLY_RX_LEN) - 1) << PSRAM_UHS_DQS1_DIFF_DLY_RX_POS))

/* 0x130 : phy_cfg_30 */
#define PSRAM_UHS_PHY_CFG_30_OFFSET  (0x130)
#define PSRAM_UHS_PHY_WL_DQ_DIG      PSRAM_UHS_PHY_WL_DQ_DIG
#define PSRAM_UHS_PHY_WL_DQ_DIG_POS  (0U)
#define PSRAM_UHS_PHY_WL_DQ_DIG_LEN  (3U)
#define PSRAM_UHS_PHY_WL_DQ_DIG_MSK  (((1U << PSRAM_UHS_PHY_WL_DQ_DIG_LEN) - 1) << PSRAM_UHS_PHY_WL_DQ_DIG_POS)
#define PSRAM_UHS_PHY_WL_DQ_DIG_UMSK (~(((1U << PSRAM_UHS_PHY_WL_DQ_DIG_LEN) - 1) << PSRAM_UHS_PHY_WL_DQ_DIG_POS))
#define PSRAM_UHS_PHY_WL_DQ_ANA      PSRAM_UHS_PHY_WL_DQ_ANA
#define PSRAM_UHS_PHY_WL_DQ_ANA_POS  (4U)
#define PSRAM_UHS_PHY_WL_DQ_ANA_LEN  (3U)
#define PSRAM_UHS_PHY_WL_DQ_ANA_MSK  (((1U << PSRAM_UHS_PHY_WL_DQ_ANA_LEN) - 1) << PSRAM_UHS_PHY_WL_DQ_ANA_POS)
#define PSRAM_UHS_PHY_WL_DQ_ANA_UMSK (~(((1U << PSRAM_UHS_PHY_WL_DQ_ANA_LEN) - 1) << PSRAM_UHS_PHY_WL_DQ_ANA_POS))
#define PSRAM_UHS_PHY_WL_DIG         PSRAM_UHS_PHY_WL_DIG
#define PSRAM_UHS_PHY_WL_DIG_POS     (8U)
#define PSRAM_UHS_PHY_WL_DIG_LEN     (3U)
#define PSRAM_UHS_PHY_WL_DIG_MSK     (((1U << PSRAM_UHS_PHY_WL_DIG_LEN) - 1) << PSRAM_UHS_PHY_WL_DIG_POS)
#define PSRAM_UHS_PHY_WL_DIG_UMSK    (~(((1U << PSRAM_UHS_PHY_WL_DIG_LEN) - 1) << PSRAM_UHS_PHY_WL_DIG_POS))
#define PSRAM_UHS_PHY_WL_ANA         PSRAM_UHS_PHY_WL_ANA
#define PSRAM_UHS_PHY_WL_ANA_POS     (12U)
#define PSRAM_UHS_PHY_WL_ANA_LEN     (3U)
#define PSRAM_UHS_PHY_WL_ANA_MSK     (((1U << PSRAM_UHS_PHY_WL_ANA_LEN) - 1) << PSRAM_UHS_PHY_WL_ANA_POS)
#define PSRAM_UHS_PHY_WL_ANA_UMSK    (~(((1U << PSRAM_UHS_PHY_WL_ANA_LEN) - 1) << PSRAM_UHS_PHY_WL_ANA_POS))
#define PSRAM_UHS_PHY_RL_DIG         PSRAM_UHS_PHY_RL_DIG
#define PSRAM_UHS_PHY_RL_DIG_POS     (16U)
#define PSRAM_UHS_PHY_RL_DIG_LEN     (4U)
#define PSRAM_UHS_PHY_RL_DIG_MSK     (((1U << PSRAM_UHS_PHY_RL_DIG_LEN) - 1) << PSRAM_UHS_PHY_RL_DIG_POS)
#define PSRAM_UHS_PHY_RL_DIG_UMSK    (~(((1U << PSRAM_UHS_PHY_RL_DIG_LEN) - 1) << PSRAM_UHS_PHY_RL_DIG_POS))
#define PSRAM_UHS_PHY_RL_ANA         PSRAM_UHS_PHY_RL_ANA
#define PSRAM_UHS_PHY_RL_ANA_POS     (20U)
#define PSRAM_UHS_PHY_RL_ANA_LEN     (3U)
#define PSRAM_UHS_PHY_RL_ANA_MSK     (((1U << PSRAM_UHS_PHY_RL_ANA_LEN) - 1) << PSRAM_UHS_PHY_RL_ANA_POS)
#define PSRAM_UHS_PHY_RL_ANA_UMSK    (~(((1U << PSRAM_UHS_PHY_RL_ANA_LEN) - 1) << PSRAM_UHS_PHY_RL_ANA_POS))
#define PSRAM_UHS_OE_TIMER           PSRAM_UHS_OE_TIMER
#define PSRAM_UHS_OE_TIMER_POS       (24U)
#define PSRAM_UHS_OE_TIMER_LEN       (2U)
#define PSRAM_UHS_OE_TIMER_MSK       (((1U << PSRAM_UHS_OE_TIMER_LEN) - 1) << PSRAM_UHS_OE_TIMER_POS)
#define PSRAM_UHS_OE_TIMER_UMSK      (~(((1U << PSRAM_UHS_OE_TIMER_LEN) - 1) << PSRAM_UHS_OE_TIMER_POS))
#define PSRAM_UHS_VREF_MODE          PSRAM_UHS_VREF_MODE
#define PSRAM_UHS_VREF_MODE_POS      (26U)
#define PSRAM_UHS_VREF_MODE_LEN      (1U)
#define PSRAM_UHS_VREF_MODE_MSK      (((1U << PSRAM_UHS_VREF_MODE_LEN) - 1) << PSRAM_UHS_VREF_MODE_POS)
#define PSRAM_UHS_VREF_MODE_UMSK     (~(((1U << PSRAM_UHS_VREF_MODE_LEN) - 1) << PSRAM_UHS_VREF_MODE_POS))
#define PSRAM_UHS_OE_CTRL_HW         PSRAM_UHS_OE_CTRL_HW
#define PSRAM_UHS_OE_CTRL_HW_POS     (27U)
#define PSRAM_UHS_OE_CTRL_HW_LEN     (1U)
#define PSRAM_UHS_OE_CTRL_HW_MSK     (((1U << PSRAM_UHS_OE_CTRL_HW_LEN) - 1) << PSRAM_UHS_OE_CTRL_HW_POS)
#define PSRAM_UHS_OE_CTRL_HW_UMSK    (~(((1U << PSRAM_UHS_OE_CTRL_HW_LEN) - 1) << PSRAM_UHS_OE_CTRL_HW_POS))
#define PSRAM_UHS_ODT_SEL            PSRAM_UHS_ODT_SEL
#define PSRAM_UHS_ODT_SEL_POS        (28U)
#define PSRAM_UHS_ODT_SEL_LEN        (4U)
#define PSRAM_UHS_ODT_SEL_MSK        (((1U << PSRAM_UHS_ODT_SEL_LEN) - 1) << PSRAM_UHS_ODT_SEL_POS)
#define PSRAM_UHS_ODT_SEL_UMSK       (~(((1U << PSRAM_UHS_ODT_SEL_LEN) - 1) << PSRAM_UHS_ODT_SEL_POS))

/* 0x134 : phy_cfg_34 */
#define PSRAM_UHS_PHY_CFG_34_OFFSET             (0x134)
#define PSRAM_UHS_REG_TIMER_DQS_START           PSRAM_UHS_REG_TIMER_DQS_START
#define PSRAM_UHS_REG_TIMER_DQS_START_POS       (0U)
#define PSRAM_UHS_REG_TIMER_DQS_START_LEN       (8U)
#define PSRAM_UHS_REG_TIMER_DQS_START_MSK       (((1U << PSRAM_UHS_REG_TIMER_DQS_START_LEN) - 1) << PSRAM_UHS_REG_TIMER_DQS_START_POS)
#define PSRAM_UHS_REG_TIMER_DQS_START_UMSK      (~(((1U << PSRAM_UHS_REG_TIMER_DQS_START_LEN) - 1) << PSRAM_UHS_REG_TIMER_DQS_START_POS))
#define PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP      PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP
#define PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP_POS  (8U)
#define PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP_LEN  (8U)
#define PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP_MSK  (((1U << PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP_LEN) - 1) << PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP_POS)
#define PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP_UMSK (~(((1U << PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP_LEN) - 1) << PSRAM_UHS_REG_TIMER_DQS_ARRAY_STOP_POS))
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE         PSRAM_UHS_REG_TIMER_ARRAY_WRITE
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE_POS     (16U)
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE_LEN     (8U)
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE_MSK     (((1U << PSRAM_UHS_REG_TIMER_ARRAY_WRITE_LEN) - 1) << PSRAM_UHS_REG_TIMER_ARRAY_WRITE_POS)
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE_UMSK    (~(((1U << PSRAM_UHS_REG_TIMER_ARRAY_WRITE_LEN) - 1) << PSRAM_UHS_REG_TIMER_ARRAY_WRITE_POS))
#define PSRAM_UHS_REG_TIMER_ARRAY_READ          PSRAM_UHS_REG_TIMER_ARRAY_READ
#define PSRAM_UHS_REG_TIMER_ARRAY_READ_POS      (24U)
#define PSRAM_UHS_REG_TIMER_ARRAY_READ_LEN      (8U)
#define PSRAM_UHS_REG_TIMER_ARRAY_READ_MSK      (((1U << PSRAM_UHS_REG_TIMER_ARRAY_READ_LEN) - 1) << PSRAM_UHS_REG_TIMER_ARRAY_READ_POS)
#define PSRAM_UHS_REG_TIMER_ARRAY_READ_UMSK     (~(((1U << PSRAM_UHS_REG_TIMER_ARRAY_READ_LEN) - 1) << PSRAM_UHS_REG_TIMER_ARRAY_READ_POS))

