RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/psram_uhs_reg.h
/* 0x138 : phy_cfg_38 */
#define PSRAM_UHS_PHY_CFG_38_OFFSET           (0x138)
#define PSRAM_UHS_REG_TIMER_AUTO_REFRESH      PSRAM_UHS_REG_TIMER_AUTO_REFRESH
#define PSRAM_UHS_REG_TIMER_AUTO_REFRESH_POS  (0U)
#define PSRAM_UHS_REG_TIMER_AUTO_REFRESH_LEN  (8U)
#define PSRAM_UHS_REG_TIMER_AUTO_REFRESH_MSK  (((1U << PSRAM_UHS_REG_TIMER_AUTO_REFRESH_LEN) - 1) << PSRAM_UHS_REG_TIMER_AUTO_REFRESH_POS)
#define PSRAM_UHS_REG_TIMER_AUTO_REFRESH_UMSK (~(((1U << PSRAM_UHS_REG_TIMER_AUTO_REFRESH_LEN) - 1) << PSRAM_UHS_REG_TIMER_AUTO_REFRESH_POS))
#define PSRAM_UHS_REG_TIMER_REG_WRITE         PSRAM_UHS_REG_TIMER_REG_WRITE
#define PSRAM_UHS_REG_TIMER_REG_WRITE_POS     (8U)
#define PSRAM_UHS_REG_TIMER_REG_WRITE_LEN     (8U)
#define PSRAM_UHS_REG_TIMER_REG_WRITE_MSK     (((1U << PSRAM_UHS_REG_TIMER_REG_WRITE_LEN) - 1) << PSRAM_UHS_REG_TIMER_REG_WRITE_POS)
#define PSRAM_UHS_REG_TIMER_REG_WRITE_UMSK    (~(((1U << PSRAM_UHS_REG_TIMER_REG_WRITE_LEN) - 1) << PSRAM_UHS_REG_TIMER_REG_WRITE_POS))
#define PSRAM_UHS_REG_TIMER_REG_READ          PSRAM_UHS_REG_TIMER_REG_READ
#define PSRAM_UHS_REG_TIMER_REG_READ_POS      (16U)
#define PSRAM_UHS_REG_TIMER_REG_READ_LEN      (8U)
#define PSRAM_UHS_REG_TIMER_REG_READ_MSK      (((1U << PSRAM_UHS_REG_TIMER_REG_READ_LEN) - 1) << PSRAM_UHS_REG_TIMER_REG_READ_POS)
#define PSRAM_UHS_REG_TIMER_REG_READ_UMSK     (~(((1U << PSRAM_UHS_REG_TIMER_REG_READ_LEN) - 1) << PSRAM_UHS_REG_TIMER_REG_READ_POS))
#define PSRAM_UHS_REG_TIMER_DQS_STOP          PSRAM_UHS_REG_TIMER_DQS_STOP
#define PSRAM_UHS_REG_TIMER_DQS_STOP_POS      (24U)
#define PSRAM_UHS_REG_TIMER_DQS_STOP_LEN      (8U)
#define PSRAM_UHS_REG_TIMER_DQS_STOP_MSK      (((1U << PSRAM_UHS_REG_TIMER_DQS_STOP_LEN) - 1) << PSRAM_UHS_REG_TIMER_DQS_STOP_POS)
#define PSRAM_UHS_REG_TIMER_DQS_STOP_UMSK     (~(((1U << PSRAM_UHS_REG_TIMER_DQS_STOP_LEN) - 1) << PSRAM_UHS_REG_TIMER_DQS_STOP_POS))

/* 0x13C : phy_cfg_3C */
#define PSRAM_UHS_PHY_CFG_3C_OFFSET                 (0x13C)
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN        PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN_POS    (0U)
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN_LEN    (8U)
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN_MSK    (((1U << PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN_LEN) - 1) << PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN_POS)
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN_UMSK   (~(((1U << PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN_LEN) - 1) << PSRAM_UHS_REG_TIMER_SELF_REFRESH1_IN_POS))
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT      PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT_POS  (8U)
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT_LEN  (8U)
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT_MSK  (((1U << PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT_LEN) - 1) << PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT_POS)
#define PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT_UMSK (~(((1U << PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT_LEN) - 1) << PSRAM_UHS_REG_TIMER_SELF_REFRESH1_EXIT_POS))
#define PSRAM_UHS_REG_TIMER_GLOBAL_RST              PSRAM_UHS_REG_TIMER_GLOBAL_RST
#define PSRAM_UHS_REG_TIMER_GLOBAL_RST_POS          (16U)
#define PSRAM_UHS_REG_TIMER_GLOBAL_RST_LEN          (14U)
#define PSRAM_UHS_REG_TIMER_GLOBAL_RST_MSK          (((1U << PSRAM_UHS_REG_TIMER_GLOBAL_RST_LEN) - 1) << PSRAM_UHS_REG_TIMER_GLOBAL_RST_POS)
#define PSRAM_UHS_REG_TIMER_GLOBAL_RST_UMSK         (~(((1U << PSRAM_UHS_REG_TIMER_GLOBAL_RST_LEN) - 1) << PSRAM_UHS_REG_TIMER_GLOBAL_RST_POS))

/* 0x140 : phy_cfg_40 */
#define PSRAM_UHS_PHY_CFG_40_OFFSET       (0x140)
#define PSRAM_UHS_VREF_SEL                PSRAM_UHS_VREF_SEL
#define PSRAM_UHS_VREF_SEL_POS            (0U)
#define PSRAM_UHS_VREF_SEL_LEN            (4U)
#define PSRAM_UHS_VREF_SEL_MSK            (((1U << PSRAM_UHS_VREF_SEL_LEN) - 1) << PSRAM_UHS_VREF_SEL_POS)
#define PSRAM_UHS_VREF_SEL_UMSK           (~(((1U << PSRAM_UHS_VREF_SEL_LEN) - 1) << PSRAM_UHS_VREF_SEL_POS))
#define PSRAM_UHS_VREF_DQ_SEL             PSRAM_UHS_VREF_DQ_SEL
#define PSRAM_UHS_VREF_DQ_SEL_POS         (4U)
#define PSRAM_UHS_VREF_DQ_SEL_LEN         (4U)
#define PSRAM_UHS_VREF_DQ_SEL_MSK         (((1U << PSRAM_UHS_VREF_DQ_SEL_LEN) - 1) << PSRAM_UHS_VREF_DQ_SEL_POS)
#define PSRAM_UHS_VREF_DQ_SEL_UMSK        (~(((1U << PSRAM_UHS_VREF_DQ_SEL_LEN) - 1) << PSRAM_UHS_VREF_DQ_SEL_POS))
#define PSRAM_UHS_REG_UHS_DMY0            PSRAM_UHS_REG_UHS_DMY0
#define PSRAM_UHS_REG_UHS_DMY0_POS        (8U)
#define PSRAM_UHS_REG_UHS_DMY0_LEN        (8U)
#define PSRAM_UHS_REG_UHS_DMY0_MSK        (((1U << PSRAM_UHS_REG_UHS_DMY0_LEN) - 1) << PSRAM_UHS_REG_UHS_DMY0_POS)
#define PSRAM_UHS_REG_UHS_DMY0_UMSK       (~(((1U << PSRAM_UHS_REG_UHS_DMY0_LEN) - 1) << PSRAM_UHS_REG_UHS_DMY0_POS))
#define PSRAM_UHS_REG_UHS_DMY1            PSRAM_UHS_REG_UHS_DMY1
#define PSRAM_UHS_REG_UHS_DMY1_POS        (16U)
#define PSRAM_UHS_REG_UHS_DMY1_LEN        (8U)
#define PSRAM_UHS_REG_UHS_DMY1_MSK        (((1U << PSRAM_UHS_REG_UHS_DMY1_LEN) - 1) << PSRAM_UHS_REG_UHS_DMY1_POS)
#define PSRAM_UHS_REG_UHS_DMY1_UMSK       (~(((1U << PSRAM_UHS_REG_UHS_DMY1_LEN) - 1) << PSRAM_UHS_REG_UHS_DMY1_POS))
#define PSRAM_UHS_REG_UHS_PHY_TEN         PSRAM_UHS_REG_UHS_PHY_TEN
#define PSRAM_UHS_REG_UHS_PHY_TEN_POS     (24U)
#define PSRAM_UHS_REG_UHS_PHY_TEN_LEN     (1U)
#define PSRAM_UHS_REG_UHS_PHY_TEN_MSK     (((1U << PSRAM_UHS_REG_UHS_PHY_TEN_LEN) - 1) << PSRAM_UHS_REG_UHS_PHY_TEN_POS)
#define PSRAM_UHS_REG_UHS_PHY_TEN_UMSK    (~(((1U << PSRAM_UHS_REG_UHS_PHY_TEN_LEN) - 1) << PSRAM_UHS_REG_UHS_PHY_TEN_POS))
#define PSRAM_UHS_SOC_EN_AON              PSRAM_UHS_SOC_EN_AON
#define PSRAM_UHS_SOC_EN_AON_POS          (25U)
#define PSRAM_UHS_SOC_EN_AON_LEN          (1U)
#define PSRAM_UHS_SOC_EN_AON_MSK          (((1U << PSRAM_UHS_SOC_EN_AON_LEN) - 1) << PSRAM_UHS_SOC_EN_AON_POS)
#define PSRAM_UHS_SOC_EN_AON_UMSK         (~(((1U << PSRAM_UHS_SOC_EN_AON_LEN) - 1) << PSRAM_UHS_SOC_EN_AON_POS))
#define PSRAM_UHS_TEN_UHS_PHY             PSRAM_UHS_TEN_UHS_PHY
#define PSRAM_UHS_TEN_UHS_PHY_POS         (26U)
#define PSRAM_UHS_TEN_UHS_PHY_LEN         (1U)
#define PSRAM_UHS_TEN_UHS_PHY_MSK         (((1U << PSRAM_UHS_TEN_UHS_PHY_LEN) - 1) << PSRAM_UHS_TEN_UHS_PHY_POS)
#define PSRAM_UHS_TEN_UHS_PHY_UMSK        (~(((1U << PSRAM_UHS_TEN_UHS_PHY_LEN) - 1) << PSRAM_UHS_TEN_UHS_PHY_POS))
#define PSRAM_UHS_TEN_UHS_PHY_DIG         PSRAM_UHS_TEN_UHS_PHY_DIG
#define PSRAM_UHS_TEN_UHS_PHY_DIG_POS     (27U)
#define PSRAM_UHS_TEN_UHS_PHY_DIG_LEN     (1U)
#define PSRAM_UHS_TEN_UHS_PHY_DIG_MSK     (((1U << PSRAM_UHS_TEN_UHS_PHY_DIG_LEN) - 1) << PSRAM_UHS_TEN_UHS_PHY_DIG_POS)
#define PSRAM_UHS_TEN_UHS_PHY_DIG_UMSK    (~(((1U << PSRAM_UHS_TEN_UHS_PHY_DIG_LEN) - 1) << PSRAM_UHS_TEN_UHS_PHY_DIG_POS))
#define PSRAM_UHS_TX_CLKTREE_GATE_HW      PSRAM_UHS_TX_CLKTREE_GATE_HW
#define PSRAM_UHS_TX_CLKTREE_GATE_HW_POS  (29U)
#define PSRAM_UHS_TX_CLKTREE_GATE_HW_LEN  (1U)
#define PSRAM_UHS_TX_CLKTREE_GATE_HW_MSK  (((1U << PSRAM_UHS_TX_CLKTREE_GATE_HW_LEN) - 1) << PSRAM_UHS_TX_CLKTREE_GATE_HW_POS)
#define PSRAM_UHS_TX_CLKTREE_GATE_HW_UMSK (~(((1U << PSRAM_UHS_TX_CLKTREE_GATE_HW_LEN) - 1) << PSRAM_UHS_TX_CLKTREE_GATE_HW_POS))
#define PSRAM_UHS_UHS_DC_TP_OUT_EN        PSRAM_UHS_UHS_DC_TP_OUT_EN
#define PSRAM_UHS_UHS_DC_TP_OUT_EN_POS    (30U)
#define PSRAM_UHS_UHS_DC_TP_OUT_EN_LEN    (1U)
#define PSRAM_UHS_UHS_DC_TP_OUT_EN_MSK    (((1U << PSRAM_UHS_UHS_DC_TP_OUT_EN_LEN) - 1) << PSRAM_UHS_UHS_DC_TP_OUT_EN_POS)
#define PSRAM_UHS_UHS_DC_TP_OUT_EN_UMSK   (~(((1U << PSRAM_UHS_UHS_DC_TP_OUT_EN_LEN) - 1) << PSRAM_UHS_UHS_DC_TP_OUT_EN_POS))
#define PSRAM_UHS_UHS_PHY_DQS_DIFF        PSRAM_UHS_UHS_PHY_DQS_DIFF
#define PSRAM_UHS_UHS_PHY_DQS_DIFF_POS    (31U)
#define PSRAM_UHS_UHS_PHY_DQS_DIFF_LEN    (1U)
#define PSRAM_UHS_UHS_PHY_DQS_DIFF_MSK    (((1U << PSRAM_UHS_UHS_PHY_DQS_DIFF_LEN) - 1) << PSRAM_UHS_UHS_PHY_DQS_DIFF_POS)
#define PSRAM_UHS_UHS_PHY_DQS_DIFF_UMSK   (~(((1U << PSRAM_UHS_UHS_PHY_DQS_DIFF_LEN) - 1) << PSRAM_UHS_UHS_PHY_DQS_DIFF_POS))

/* 0x144 : phy_cfg_44 */
#define PSRAM_UHS_PHY_CFG_44_OFFSET               (0x144)
#define PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY       PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY
#define PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY_POS   (0U)
#define PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY_LEN   (8U)
#define PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY_MSK   (((1U << PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY_LEN) - 1) << PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY_POS)
#define PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY_UMSK  (~(((1U << PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY_LEN) - 1) << PSRAM_UHS_REG_TIMER_ARRAY_READ_BUSY_POS))
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY      PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY_POS  (8U)
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY_LEN  (8U)
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY_MSK  (((1U << PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY_LEN) - 1) << PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY_POS)
#define PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY_UMSK (~(((1U << PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY_LEN) - 1) << PSRAM_UHS_REG_TIMER_ARRAY_WRITE_BUSY_POS))
#define PSRAM_UHS_REG_TIMER_REG_READ_BUSY         PSRAM_UHS_REG_TIMER_REG_READ_BUSY
#define PSRAM_UHS_REG_TIMER_REG_READ_BUSY_POS     (16U)
#define PSRAM_UHS_REG_TIMER_REG_READ_BUSY_LEN     (8U)
#define PSRAM_UHS_REG_TIMER_REG_READ_BUSY_MSK     (((1U << PSRAM_UHS_REG_TIMER_REG_READ_BUSY_LEN) - 1) << PSRAM_UHS_REG_TIMER_REG_READ_BUSY_POS)
#define PSRAM_UHS_REG_TIMER_REG_READ_BUSY_UMSK    (~(((1U << PSRAM_UHS_REG_TIMER_REG_READ_BUSY_LEN) - 1) << PSRAM_UHS_REG_TIMER_REG_READ_BUSY_POS))
#define PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY        PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY
#define PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY_POS    (24U)
#define PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY_LEN    (8U)
#define PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY_MSK    (((1U << PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY_LEN) - 1) << PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY_POS)
#define PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY_UMSK   (~(((1U << PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY_LEN) - 1) << PSRAM_UHS_REG_TIMER_REG_WRITE_BUSY_POS))

/* 0x148 : phy_cfg_48 */
#define PSRAM_UHS_PHY_CFG_48_OFFSET     (0x148)
#define PSRAM_UHS_TMUX                  PSRAM_UHS_TMUX
#define PSRAM_UHS_TMUX_POS              (0U)
#define PSRAM_UHS_TMUX_LEN              (3U)
#define PSRAM_UHS_TMUX_MSK              (((1U << PSRAM_UHS_TMUX_LEN) - 1) << PSRAM_UHS_TMUX_POS)
#define PSRAM_UHS_TMUX_UMSK             (~(((1U << PSRAM_UHS_TMUX_LEN) - 1) << PSRAM_UHS_TMUX_POS))
#define PSRAM_UHS_CHIP_EN_33            PSRAM_UHS_CHIP_EN_33
#define PSRAM_UHS_CHIP_EN_33_POS        (3U)
#define PSRAM_UHS_CHIP_EN_33_LEN        (1U)
#define PSRAM_UHS_CHIP_EN_33_MSK        (((1U << PSRAM_UHS_CHIP_EN_33_LEN) - 1) << PSRAM_UHS_CHIP_EN_33_POS)
#define PSRAM_UHS_CHIP_EN_33_UMSK       (~(((1U << PSRAM_UHS_CHIP_EN_33_LEN) - 1) << PSRAM_UHS_CHIP_EN_33_POS))
#define PSRAM_UHS_TMUX_UHS_PHY_DIG      PSRAM_UHS_TMUX_UHS_PHY_DIG
#define PSRAM_UHS_TMUX_UHS_PHY_DIG_POS  (4U)
#define PSRAM_UHS_TMUX_UHS_PHY_DIG_LEN  (3U)
#define PSRAM_UHS_TMUX_UHS_PHY_DIG_MSK  (((1U << PSRAM_UHS_TMUX_UHS_PHY_DIG_LEN) - 1) << PSRAM_UHS_TMUX_UHS_PHY_DIG_POS)
#define PSRAM_UHS_TMUX_UHS_PHY_DIG_UMSK (~(((1U << PSRAM_UHS_TMUX_UHS_PHY_DIG_LEN) - 1) << PSRAM_UHS_TMUX_UHS_PHY_DIG_POS))
#define PSRAM_UHS_PSRAM_TYPE            PSRAM_UHS_PSRAM_TYPE
#define PSRAM_UHS_PSRAM_TYPE_POS        (8U)
#define PSRAM_UHS_PSRAM_TYPE_LEN        (2U)
#define PSRAM_UHS_PSRAM_TYPE_MSK        (((1U << PSRAM_UHS_PSRAM_TYPE_LEN) - 1) << PSRAM_UHS_PSRAM_TYPE_POS)
#define PSRAM_UHS_PSRAM_TYPE_UMSK       (~(((1U << PSRAM_UHS_PSRAM_TYPE_LEN) - 1) << PSRAM_UHS_PSRAM_TYPE_POS))
#define PSRAM_UHS_PU_UHS_PW1P8          PSRAM_UHS_PU_UHS_PW1P8
#define PSRAM_UHS_PU_UHS_PW1P8_POS      (11U)
#define PSRAM_UHS_PU_UHS_PW1P8_LEN      (1U)
#define PSRAM_UHS_PU_UHS_PW1P8_MSK      (((1U << PSRAM_UHS_PU_UHS_PW1P8_LEN) - 1) << PSRAM_UHS_PU_UHS_PW1P8_POS)
#define PSRAM_UHS_PU_UHS_PW1P8_UMSK     (~(((1U << PSRAM_UHS_PU_UHS_PW1P8_LEN) - 1) << PSRAM_UHS_PU_UHS_PW1P8_POS))
#define PSRAM_UHS_REG_TEST_DIV_SEL      PSRAM_UHS_REG_TEST_DIV_SEL
#define PSRAM_UHS_REG_TEST_DIV_SEL_POS  (12U)
#define PSRAM_UHS_REG_TEST_DIV_SEL_LEN  (3U)
#define PSRAM_UHS_REG_TEST_DIV_SEL_MSK  (((1U << PSRAM_UHS_REG_TEST_DIV_SEL_LEN) - 1) << PSRAM_UHS_REG_TEST_DIV_SEL_POS)
#define PSRAM_UHS_REG_TEST_DIV_SEL_UMSK (~(((1U << PSRAM_UHS_REG_TEST_DIV_SEL_LEN) - 1) << PSRAM_UHS_REG_TEST_DIV_SEL_POS))
#define PSRAM_UHS_EN_RX_FE_HW           PSRAM_UHS_EN_RX_FE_HW
#define PSRAM_UHS_EN_RX_FE_HW_POS       (15U)
#define PSRAM_UHS_EN_RX_FE_HW_LEN       (1U)
#define PSRAM_UHS_EN_RX_FE_HW_MSK       (((1U << PSRAM_UHS_EN_RX_FE_HW_LEN) - 1) << PSRAM_UHS_EN_RX_FE_HW_POS)
#define PSRAM_UHS_EN_RX_FE_HW_UMSK      (~(((1U << PSRAM_UHS_EN_RX_FE_HW_LEN) - 1) << PSRAM_UHS_EN_RX_FE_HW_POS))
#define PSRAM_UHS_REG_TEST_MUX_SEL      PSRAM_UHS_REG_TEST_MUX_SEL
#define PSRAM_UHS_REG_TEST_MUX_SEL_POS  (16U)
#define PSRAM_UHS_REG_TEST_MUX_SEL_LEN  (3U)
#define PSRAM_UHS_REG_TEST_MUX_SEL_MSK  (((1U << PSRAM_UHS_REG_TEST_MUX_SEL_LEN) - 1) << PSRAM_UHS_REG_TEST_MUX_SEL_POS)
#define PSRAM_UHS_REG_TEST_MUX_SEL_UMSK (~(((1U << PSRAM_UHS_REG_TEST_MUX_SEL_LEN) - 1) << PSRAM_UHS_REG_TEST_MUX_SEL_POS))
#define PSRAM_UHS_FORCE_FSM             PSRAM_UHS_FORCE_FSM
#define PSRAM_UHS_FORCE_FSM_POS         (19U)
#define PSRAM_UHS_FORCE_FSM_LEN         (1U)
#define PSRAM_UHS_FORCE_FSM_MSK         (((1U << PSRAM_UHS_FORCE_FSM_LEN) - 1) << PSRAM_UHS_FORCE_FSM_POS)
#define PSRAM_UHS_FORCE_FSM_UMSK        (~(((1U << PSRAM_UHS_FORCE_FSM_LEN) - 1) << PSRAM_UHS_FORCE_FSM_POS))
#define PSRAM_UHS_EN_RX_FE_DLY          PSRAM_UHS_EN_RX_FE_DLY
#define PSRAM_UHS_EN_RX_FE_DLY_POS      (20U)
#define PSRAM_UHS_EN_RX_FE_DLY_LEN      (4U)
#define PSRAM_UHS_EN_RX_FE_DLY_MSK      (((1U << PSRAM_UHS_EN_RX_FE_DLY_LEN) - 1) << PSRAM_UHS_EN_RX_FE_DLY_POS)
#define PSRAM_UHS_EN_RX_FE_DLY_UMSK     (~(((1U << PSRAM_UHS_EN_RX_FE_DLY_LEN) - 1) << PSRAM_UHS_EN_RX_FE_DLY_POS))

/* 0x14C : phy_cfg_4C */
#define PSRAM_UHS_PHY_CFG_4C_OFFSET     (0x14C)
#define PSRAM_UHS_TOUT_UHS_PHY_DIG      PSRAM_UHS_TOUT_UHS_PHY_DIG
#define PSRAM_UHS_TOUT_UHS_PHY_DIG_POS  (0U)
#define PSRAM_UHS_TOUT_UHS_PHY_DIG_LEN  (16U)
#define PSRAM_UHS_TOUT_UHS_PHY_DIG_MSK  (((1U << PSRAM_UHS_TOUT_UHS_PHY_DIG_LEN) - 1) << PSRAM_UHS_TOUT_UHS_PHY_DIG_POS)
#define PSRAM_UHS_TOUT_UHS_PHY_DIG_UMSK (~(((1U << PSRAM_UHS_TOUT_UHS_PHY_DIG_LEN) - 1) << PSRAM_UHS_TOUT_UHS_PHY_DIG_POS))
#define PSRAM_UHS_ODT_SEL_DLY           PSRAM_UHS_ODT_SEL_DLY
#define PSRAM_UHS_ODT_SEL_DLY_POS       (16U)
#define PSRAM_UHS_ODT_SEL_DLY_LEN       (4U)
#define PSRAM_UHS_ODT_SEL_DLY_MSK       (((1U << PSRAM_UHS_ODT_SEL_DLY_LEN) - 1) << PSRAM_UHS_ODT_SEL_DLY_POS)
#define PSRAM_UHS_ODT_SEL_DLY_UMSK      (~(((1U << PSRAM_UHS_ODT_SEL_DLY_LEN) - 1) << PSRAM_UHS_ODT_SEL_DLY_POS))
#define PSRAM_UHS_ODT_SEL_HW            PSRAM_UHS_ODT_SEL_HW
#define PSRAM_UHS_ODT_SEL_HW_POS        (20U)
#define PSRAM_UHS_ODT_SEL_HW_LEN        (1U)
#define PSRAM_UHS_ODT_SEL_HW_MSK        (((1U << PSRAM_UHS_ODT_SEL_HW_LEN) - 1) << PSRAM_UHS_ODT_SEL_HW_POS)
#define PSRAM_UHS_ODT_SEL_HW_UMSK       (~(((1U << PSRAM_UHS_ODT_SEL_HW_LEN) - 1) << PSRAM_UHS_ODT_SEL_HW_POS))

/* 0x150 : phy_cfg_50 */
#define PSRAM_UHS_PHY_CFG_50_OFFSET    (0x150)
#define PSRAM_UHS_DQ_OE_UP_P_REG       PSRAM_UHS_DQ_OE_UP_P_REG
#define PSRAM_UHS_DQ_OE_UP_P_REG_POS   (0U)
#define PSRAM_UHS_DQ_OE_UP_P_REG_LEN   (3U)
#define PSRAM_UHS_DQ_OE_UP_P_REG_MSK   (((1U << PSRAM_UHS_DQ_OE_UP_P_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_UP_P_REG_POS)
#define PSRAM_UHS_DQ_OE_UP_P_REG_UMSK  (~(((1U << PSRAM_UHS_DQ_OE_UP_P_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_UP_P_REG_POS))
#define PSRAM_UHS_DQ_OE_UP_N_REG       PSRAM_UHS_DQ_OE_UP_N_REG
#define PSRAM_UHS_DQ_OE_UP_N_REG_POS   (4U)
#define PSRAM_UHS_DQ_OE_UP_N_REG_LEN   (3U)
#define PSRAM_UHS_DQ_OE_UP_N_REG_MSK   (((1U << PSRAM_UHS_DQ_OE_UP_N_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_UP_N_REG_POS)
#define PSRAM_UHS_DQ_OE_UP_N_REG_UMSK  (~(((1U << PSRAM_UHS_DQ_OE_UP_N_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_UP_N_REG_POS))
#define PSRAM_UHS_DQ_OE_MID_P_REG      PSRAM_UHS_DQ_OE_MID_P_REG
#define PSRAM_UHS_DQ_OE_MID_P_REG_POS  (8U)
#define PSRAM_UHS_DQ_OE_MID_P_REG_LEN  (3U)
#define PSRAM_UHS_DQ_OE_MID_P_REG_MSK  (((1U << PSRAM_UHS_DQ_OE_MID_P_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_MID_P_REG_POS)
#define PSRAM_UHS_DQ_OE_MID_P_REG_UMSK (~(((1U << PSRAM_UHS_DQ_OE_MID_P_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_MID_P_REG_POS))
#define PSRAM_UHS_DQ_OE_MID_N_REG      PSRAM_UHS_DQ_OE_MID_N_REG
#define PSRAM_UHS_DQ_OE_MID_N_REG_POS  (12U)
#define PSRAM_UHS_DQ_OE_MID_N_REG_LEN  (3U)
#define PSRAM_UHS_DQ_OE_MID_N_REG_MSK  (((1U << PSRAM_UHS_DQ_OE_MID_N_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_MID_N_REG_POS)
#define PSRAM_UHS_DQ_OE_MID_N_REG_UMSK (~(((1U << PSRAM_UHS_DQ_OE_MID_N_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_MID_N_REG_POS))
#define PSRAM_UHS_DQ_OE_DN_P_REG       PSRAM_UHS_DQ_OE_DN_P_REG
#define PSRAM_UHS_DQ_OE_DN_P_REG_POS   (16U)
#define PSRAM_UHS_DQ_OE_DN_P_REG_LEN   (3U)
#define PSRAM_UHS_DQ_OE_DN_P_REG_MSK   (((1U << PSRAM_UHS_DQ_OE_DN_P_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_DN_P_REG_POS)
#define PSRAM_UHS_DQ_OE_DN_P_REG_UMSK  (~(((1U << PSRAM_UHS_DQ_OE_DN_P_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_DN_P_REG_POS))
#define PSRAM_UHS_DQ_OE_DN_N_REG       PSRAM_UHS_DQ_OE_DN_N_REG
#define PSRAM_UHS_DQ_OE_DN_N_REG_POS   (20U)
#define PSRAM_UHS_DQ_OE_DN_N_REG_LEN   (3U)
#define PSRAM_UHS_DQ_OE_DN_N_REG_MSK   (((1U << PSRAM_UHS_DQ_OE_DN_N_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_DN_N_REG_POS)
#define PSRAM_UHS_DQ_OE_DN_N_REG_UMSK  (~(((1U << PSRAM_UHS_DQ_OE_DN_N_REG_LEN) - 1) << PSRAM_UHS_DQ_OE_DN_N_REG_POS))
#define PSRAM_UHS_PHY_WL_CEN_ANA       PSRAM_UHS_PHY_WL_CEN_ANA
#define PSRAM_UHS_PHY_WL_CEN_ANA_POS   (24U)
#define PSRAM_UHS_PHY_WL_CEN_ANA_LEN   (3U)
#define PSRAM_UHS_PHY_WL_CEN_ANA_MSK   (((1U << PSRAM_UHS_PHY_WL_CEN_ANA_LEN) - 1) << PSRAM_UHS_PHY_WL_CEN_ANA_POS)
#define PSRAM_UHS_PHY_WL_CEN_ANA_UMSK  (~(((1U << PSRAM_UHS_PHY_WL_CEN_ANA_LEN) - 1) << PSRAM_UHS_PHY_WL_CEN_ANA_POS))

struct psram_uhs_reg {
    /* 0x0 : UHS_basic */
    union {
        struct {
            uint32_t reg_init_en      : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_af_en        : 1; /* [    1],        r/w,        0x0 */
            uint32_t reg_config_req   : 1; /* [    2],        r/w,        0x0 */
            uint32_t reg_config_gnt   : 1; /* [    3],          r,        0x0 */
            uint32_t reserved_4_7     : 4; /* [ 7: 4],       rsvd,        0x0 */
            uint32_t reg_mode_reg     : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_addrMB_msk   : 8; /* [23:16],        r/w,       0x1f */
            uint32_t reserved_24_27   : 4; /* [27:24],       rsvd,        0x0 */
            uint32_t reg_linear_bnd_b : 4; /* [31:28],        r/w,        0xa */
        } BF;
        uint32_t WORD;
    } UHS_basic;

    /* 0x4 : UHS_cmd */
    union {
        struct {
            uint32_t reg_glbr_pulse  : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reg_srfi_pulse  : 1;  /* [    1],        w1p,        0x0 */
            uint32_t reg_srfo_pulse  : 1;  /* [    2],        w1p,        0x0 */
            uint32_t reg_regw_pulse  : 1;  /* [    3],        w1p,        0x0 */
            uint32_t reg_regr_pulse  : 1;  /* [    4],        w1p,        0x0 */
            uint32_t reserved_5_7    : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t sts_glbr_done   : 1;  /* [    8],          r,        0x0 */
            uint32_t sts_srfi_done   : 1;  /* [    9],          r,        0x0 */
            uint32_t sts_srfo_done   : 1;  /* [   10],          r,        0x0 */
            uint32_t sts_regw_done   : 1;  /* [   11],          r,        0x0 */
            uint32_t sts_regr_done   : 1;  /* [   12],          r,        0x0 */
            uint32_t sts_init_done   : 1;  /* [   13],          r,        0x0 */
            uint32_t reserved_14_23  : 10; /* [23:14],       rsvd,        0x0 */
            uint32_t sts_config_read : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_cmd;

