RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/psram_uhs_reg.h
    /* 0x8 : UHS_fifo_thre */
    union {
        struct {
            uint32_t reg_mask_w_fifo_cnt : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_mask_r_fifo_rem : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_fifo_thre;

    /* 0xC : UHS_manual */
    union {
        struct {
            uint32_t reg_force_ceb_low  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_force_ceb_high : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_psram_resetb   : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reg_x16_mode       : 1;  /* [    3],        r/w,        0x1 */
            uint32_t reg_wrap2incr_en   : 1;  /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_15      : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t reg_pck_s_div      : 3;  /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19_23     : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t reg_pck_t_div      : 8;  /* [31:24],        r/w,       0x40 */
        } BF;
        uint32_t WORD;
    } UHS_manual;

    /* 0x10 : UHS_auto_fresh_1 */
    union {
        struct {
            uint32_t reg_win_cycle  : 28; /* [27: 0],        r/w,    0x27100 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_auto_fresh_1;

    /* 0x14 : UHS_auto_fresh_2 */
    union {
        struct {
            uint32_t reg_refi_cycle  : 16; /* [15: 0],        r/w,       0x27 */
            uint32_t reg_win_ref_cnt : 13; /* [28:16],        r/w,     0x1000 */
            uint32_t reserved_29_31  : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_auto_fresh_2;

    /* 0x18 : UHS_auto_fresh_3 */
    union {
        struct {
            uint32_t reg_auto_ref_thre  : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15     : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t auto_refresh_level : 12; /* [27:16],          r,        0x0 */
            uint32_t reserved_28_31     : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_auto_fresh_3;

    /* 0x1C : UHS_auto_fresh_4 */
    union {
        struct {
            uint32_t reg_bust_cycle : 7;  /* [ 6: 0],        r/w,       0x1d */
            uint32_t reserved_7_31  : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_auto_fresh_4;

    /* 0x20 : UHS_psram_configure */
    union {
        struct {
            uint32_t reg_uhs_latency  : 3;  /* [ 2: 0],        r/w,        0x5 */
            uint32_t reserved_3       : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t reg_uhs_drive_st : 4;  /* [ 7: 4],        r/w,        0xa */
            uint32_t reg_uhs_bl_16    : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reg_uhs_bl_32    : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reg_uhs_bl_64    : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_31   : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_psram_configure;

    /* 0x24 : UHS_psram_status */
    union {
        struct {
            uint32_t sts_uhs_latency  : 3;  /* [ 2: 0],          r,        0x5 */
            uint32_t reserved_3       : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t sts_uhs_drive_st : 4;  /* [ 7: 4],          r,        0xa */
            uint32_t sts_uhs_bl_16    : 1;  /* [    8],          r,        0x0 */
            uint32_t sts_uhs_bl_32    : 1;  /* [    9],          r,        0x0 */
            uint32_t sts_uhs_bl_64    : 1;  /* [   10],          r,        0x0 */
            uint32_t reserved_11_31   : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_psram_status;

    /* 0x28  reserved */
    uint8_t RESERVED0x28[8];

    /* 0x30 : UHS_timing_ctrl */
    union {
        struct {
            uint32_t reg_trc_cycle   : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_tcphr_cycle : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_tcphw_cycle : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_trfc_cycle  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_timing_ctrl;

    /* 0x34 : UHS_rsvd_reg */
    union {
        struct {
            uint32_t reg_mr0_7     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_mr2_2_0   : 3;  /* [ 3: 1],        r/w,        0x0 */
            uint32_t reg_mr2_7_6   : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_31 : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_rsvd_reg;

    /* 0x38  reserved */
    uint8_t RESERVED0x38[136];

    /* 0xC0 : UHS_dbg_sel */
    union {
        struct {
            uint32_t reg_psram_dbg_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3      : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_psram_dbg_sel : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } UHS_dbg_sel;

    /* 0xc4  reserved */
    uint8_t RESERVED0xc4[44];

    /* 0xF0 : UHS_dummy_reg */
    union {
        struct {
            uint32_t reg_psram_dummy_reg : 32; /* [31: 0],        r/w, 0xffff0000 */
        } BF;
        uint32_t WORD;
    } UHS_dummy_reg;

    /* 0xf4  reserved */
    uint8_t RESERVED0xf4[12];

    /* 0x100 : phy_cfg_00 */
    union {
        struct {
            uint32_t dqs_rdy        : 1; /* [    0],          r,        0x0 */
            uint32_t reserved_1_7   : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t ck_sr          : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_14 : 5; /* [14:10],       rsvd,        0x0 */
            uint32_t clk0_polarity  : 1; /* [   15],        r/w,        0x0 */
            uint32_t ck_dly_drv     : 4; /* [19:16],        r/w,        0x8 */
            uint32_t cen_sr         : 2; /* [21:20],        r/w,        0x0 */
            uint32_t reserved_22_27 : 6; /* [27:22],       rsvd,        0x0 */
            uint32_t cen_dly_drv    : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_00;

    /* 0x104 : phy_cfg_04 */
    union {
        struct {
            uint32_t reserved_0_3   : 4; /* [ 3: 0],       rsvd,        0x0 */
            uint32_t dm1_sr         : 2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6_11  : 6; /* [11: 6],       rsvd,        0x0 */
            uint32_t dm1_dly_drv    : 4; /* [15:12],        r/w,        0x8 */
            uint32_t reserved_16_19 : 4; /* [19:16],       rsvd,        0x0 */
            uint32_t dm0_sr         : 2; /* [21:20],        r/w,        0x0 */
            uint32_t reserved_22_27 : 6; /* [27:22],       rsvd,        0x0 */
            uint32_t dm0_dly_drv    : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_04;

