RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/psram_uhs_reg.h
    /* 0x108 : phy_cfg_08 */
    union {
        struct {
            uint32_t dq1_sr         : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7   : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t dq1_dly_rx     : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dq1_dly_drv    : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dq0_sr         : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t dq0_dly_rx     : 4; /* [27:24],        r/w,        0x1 */
            uint32_t dq0_dly_drv    : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_08;

    /* 0x10C : phy_cfg_0C */
    union {
        struct {
            uint32_t dq3_sr         : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7   : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t dq3_dly_rx     : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dq3_dly_drv    : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dq2_sr         : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t dq2_dly_rx     : 4; /* [27:24],        r/w,        0x1 */
            uint32_t dq2_dly_drv    : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_0C;

    /* 0x110 : phy_cfg_10 */
    union {
        struct {
            uint32_t dq5_sr         : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7   : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t dq5_dly_rx     : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dq5_dly_drv    : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dq4_sr         : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t dq4_dly_rx     : 4; /* [27:24],        r/w,        0x1 */
            uint32_t dq4_dly_drv    : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_10;

    /* 0x114 : phy_cfg_14 */
    union {
        struct {
            uint32_t dq7_sr         : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7   : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t dq7_dly_rx     : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dq7_dly_drv    : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dq6_sr         : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t dq6_dly_rx     : 4; /* [27:24],        r/w,        0x1 */
            uint32_t dq6_dly_drv    : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_14;

    /* 0x118 : phy_cfg_18 */
    union {
        struct {
            uint32_t dq9_sr         : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7   : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t dq9_dly_rx     : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dq9_dly_drv    : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dq8_sr         : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t dq8_dly_rx     : 4; /* [27:24],        r/w,        0x1 */
            uint32_t dq8_dly_drv    : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_18;

    /* 0x11C : phy_cfg_1C */
    union {
        struct {
            uint32_t dq11_sr        : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7   : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t dq11_dly_rx    : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dq11_dly_drv   : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dq10_sr        : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t dq10_dly_rx    : 4; /* [27:24],        r/w,        0x1 */
            uint32_t dq10_dly_drv   : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_1C;

    /* 0x120 : phy_cfg_20 */
    union {
        struct {
            uint32_t dq13_sr        : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7   : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t dq13_dly_rx    : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dq13_dly_drv   : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dq12_sr        : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t dq12_dly_rx    : 4; /* [27:24],        r/w,        0x1 */
            uint32_t dq12_dly_drv   : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_20;

    /* 0x124 : phy_cfg_24 */
    union {
        struct {
            uint32_t dq15_sr        : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_7   : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t dq15_dly_rx    : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dq15_dly_drv   : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dq14_sr        : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t dq14_dly_rx    : 4; /* [27:24],        r/w,        0x1 */
            uint32_t dq14_dly_drv   : 4; /* [31:28],        r/w,        0x8 */
        } BF;
        uint32_t WORD;
    } phy_cfg_24;

    /* 0x128 : phy_cfg_28 */
    union {
        struct {
            uint32_t reserved_0_7     : 8; /* [ 7: 0],       rsvd,        0x0 */
            uint32_t dqs0n_dly_rx     : 4; /* [11: 8],        r/w,        0x3 */
            uint32_t dqs0_sr          : 2; /* [13:12],        r/w,        0x0 */
            uint32_t dqs0_sel         : 2; /* [15:14],        r/w,        0x0 */
            uint32_t reserved_16_19   : 4; /* [19:16],       rsvd,        0x0 */
            uint32_t dqs0_dly_rx      : 4; /* [23:20],        r/w,        0x3 */
            uint32_t dqs0_dly_drv     : 4; /* [27:24],        r/w,        0x8 */
            uint32_t dqs0_diff_dly_rx : 4; /* [31:28],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } phy_cfg_28;

    /* 0x12C : phy_cfg_2C */
    union {
        struct {
            uint32_t ipp5un_lpddr     : 1; /* [    0],        r/w,        0x0 */
            uint32_t en_rx_fe         : 1; /* [    1],        r/w,        0x1 */
            uint32_t en_bias          : 1; /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_7     : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t dqs1n_dly_rx     : 4; /* [11: 8],        r/w,        0x3 */
            uint32_t dqs1_sr          : 2; /* [13:12],        r/w,        0x0 */
            uint32_t dqs1_sel         : 2; /* [15:14],        r/w,        0x0 */
            uint32_t reserved_16_19   : 4; /* [19:16],       rsvd,        0x0 */
            uint32_t dqs1_dly_rx      : 4; /* [23:20],        r/w,        0x3 */
            uint32_t dqs1_dly_drv     : 4; /* [27:24],        r/w,        0x8 */
            uint32_t dqs1_diff_dly_rx : 4; /* [31:28],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } phy_cfg_2C;

    /* 0x130 : phy_cfg_30 */
    union {
        struct {
            uint32_t phy_wl_dq_dig : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t reserved_3    : 1; /* [    3],       rsvd,        0x0 */
            uint32_t phy_wl_dq_ana : 3; /* [ 6: 4],        r/w,        0x2 */
            uint32_t reserved_7    : 1; /* [    7],       rsvd,        0x0 */
            uint32_t phy_wl_dig    : 3; /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11   : 1; /* [   11],       rsvd,        0x0 */
            uint32_t phy_wl_ana    : 3; /* [14:12],        r/w,        0x1 */
            uint32_t reserved_15   : 1; /* [   15],       rsvd,        0x0 */
            uint32_t phy_rl_dig    : 4; /* [19:16],        r/w,        0x3 */
            uint32_t phy_rl_ana    : 3; /* [22:20],        r/w,        0x3 */
            uint32_t reserved_23   : 1; /* [   23],       rsvd,        0x0 */
            uint32_t oe_timer      : 2; /* [25:24],        r/w,        0x2 */
            uint32_t vref_mode     : 1; /* [   26],        r/w,        0x0 */
            uint32_t oe_ctrl_hw    : 1; /* [   27],        r/w,        0x1 */
            uint32_t odt_sel       : 4; /* [31:28],        r/w,        0xa */
        } BF;
        uint32_t WORD;
    } phy_cfg_30;

    /* 0x134 : phy_cfg_34 */
    union {
        struct {
            uint32_t reg_timer_dqs_start      : 8; /* [ 7: 0],        r/w,        0x1 */
            uint32_t reg_timer_dqs_array_stop : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t reg_timer_array_write    : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_timer_array_read     : 8; /* [31:24],        r/w,        0x5 */
        } BF;
        uint32_t WORD;
    } phy_cfg_34;

    /* 0x138 : phy_cfg_38 */
    union {
        struct {
            uint32_t reg_timer_auto_refresh : 8; /* [ 7: 0],        r/w,        0x7 */
            uint32_t reg_timer_reg_write    : 8; /* [15: 8],        r/w,        0x1 */
            uint32_t reg_timer_reg_read     : 8; /* [23:16],        r/w,        0x8 */
            uint32_t reg_timer_dqs_stop     : 8; /* [31:24],        r/w,        0x2 */
        } BF;
        uint32_t WORD;
    } phy_cfg_38;

    /* 0x13C : phy_cfg_3C */
    union {
        struct {
            uint32_t reg_timer_self_refresh1_in   : 8;  /* [ 7: 0],        r/w,        0x8 */
            uint32_t reg_timer_self_refresh1_exit : 8;  /* [15: 8],        r/w,        0x8 */
            uint32_t reg_timer_global_rst         : 14; /* [29:16],        r/w,      0x272 */
            uint32_t reserved_30_31               : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } phy_cfg_3C;

    /* 0x140 : phy_cfg_40 */
    union {
        struct {
            uint32_t vref_sel           : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t vref_dq_sel        : 4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t reg_uhs_dmy0       : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_uhs_dmy1       : 8; /* [23:16],        r/w,       0xff */
            uint32_t reg_uhs_phy_ten    : 1; /* [   24],        r/w,        0x0 */
            uint32_t soc_en_aon         : 1; /* [   25],        r/w,        0x1 */
            uint32_t ten_uhs_phy        : 1; /* [   26],        r/w,        0x0 */
            uint32_t ten_uhs_phy_dig    : 1; /* [   27],        r/w,        0x0 */
            uint32_t reserved_28        : 1; /* [   28],       rsvd,        0x0 */
            uint32_t tx_clktree_gate_hw : 1; /* [   29],        r/w,        0x1 */
            uint32_t uhs_dc_tp_out_en   : 1; /* [   30],        r/w,        0x0 */
            uint32_t uhs_phy_dqs_diff   : 1; /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } phy_cfg_40;

    /* 0x144 : phy_cfg_44 */
    union {
        struct {
            uint32_t reg_timer_array_read_busy  : 8; /* [ 7: 0],        r/w,        0x8 */
            uint32_t reg_timer_array_write_busy : 8; /* [15: 8],        r/w,        0x3 */
            uint32_t reg_timer_reg_read_busy    : 8; /* [23:16],        r/w,        0xb */
            uint32_t reg_timer_reg_write_busy   : 8; /* [31:24],        r/w,        0x4 */
        } BF;
        uint32_t WORD;
    } phy_cfg_44;

    /* 0x148 : phy_cfg_48 */
    union {
        struct {
            uint32_t tmux             : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t chip_en_33       : 1; /* [    3],        r/w,        0x1 */
            uint32_t tmux_uhs_phy_dig : 3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7       : 1; /* [    7],       rsvd,        0x0 */
            uint32_t psram_type       : 2; /* [ 9: 8],        r/w,        0x1 */
            uint32_t reserved_10      : 1; /* [   10],       rsvd,        0x0 */
            uint32_t pu_uhs_pw1p8     : 1; /* [   11],        r/w,        0x1 */
            uint32_t reg_test_div_sel : 3; /* [14:12],        r/w,        0x0 */
            uint32_t en_rx_fe_hw      : 1; /* [   15],        r/w,        0x1 */
            uint32_t reg_test_mux_sel : 3; /* [18:16],        r/w,        0x0 */
            uint32_t force_fsm        : 1; /* [   19],        r/w,        0x0 */
            uint32_t en_rx_fe_dly     : 4; /* [23:20],        r/w,        0x2 */
            uint32_t reserved_24_31   : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } phy_cfg_48;

    /* 0x14C : phy_cfg_4C */
    union {
        struct {
            uint32_t tout_uhs_phy_dig : 16; /* [15: 0],          r,        0x0 */
            uint32_t odt_sel_dly      : 4;  /* [19:16],        r/w,        0x3 */
            uint32_t odt_sel_hw       : 1;  /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_31   : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } phy_cfg_4C;

    /* 0x150 : phy_cfg_50 */
    union {
        struct {
            uint32_t dq_oe_up_p_reg  : 3; /* [ 2: 0],        r/w,        0x4 */
            uint32_t reserved_3      : 1; /* [    3],       rsvd,        0x0 */
            uint32_t dq_oe_up_n_reg  : 3; /* [ 6: 4],        r/w,        0x4 */
            uint32_t reserved_7      : 1; /* [    7],       rsvd,        0x0 */
            uint32_t dq_oe_mid_p_reg : 3; /* [10: 8],        r/w,        0x4 */
            uint32_t reserved_11     : 1; /* [   11],       rsvd,        0x0 */
            uint32_t dq_oe_mid_n_reg : 3; /* [14:12],        r/w,        0x4 */
            uint32_t reserved_15     : 1; /* [   15],       rsvd,        0x0 */
            uint32_t dq_oe_dn_p_reg  : 3; /* [18:16],        r/w,        0x4 */
            uint32_t reserved_19     : 1; /* [   19],       rsvd,        0x0 */
            uint32_t dq_oe_dn_n_reg  : 3; /* [22:20],        r/w,        0x4 */
            uint32_t reserved_23     : 1; /* [   23],       rsvd,        0x0 */
            uint32_t phy_wl_cen_ana  : 3; /* [26:24],        r/w,        0x1 */
            uint32_t reserved_27_31  : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } phy_cfg_50;
};

typedef volatile struct psram_uhs_reg psram_uhs_reg_t;

#endif /* __PSRAM_UHS_REG_H__ */
